README.org
#+TITLE: YTU CE
#+SETUPFILE: theme-readtheorg.setup
#+OPTIONS: num:nil
#+OPTIONS: \n:t
#+AUTHOR: Furkan Karataş
* Veri Yapıları
** 1. Ders

Not dağılımı: (2 vize + 2 ödev + Proje + 4 lab) = %60, final = %40

Soru: Verilen bir n sayısı için 1'den n'e kadar olan asal sayıları bulan
algoritmayı tasarlayın.

C kodu: ([[https://github.com/haliluluoglu/YTU-CE/blob/C-Language/Veri%20Yap%C4%B1lar%C4%B1%20ve%20Algoritmalar%C4%B1/primeNumber.c][Halil İbrahim Uluoğlu]])
#+begin_src C
  #include <stdio.h>
  #include <math.h>
  #include <stdlib.h>

  void main()
  {
    int number,i,j,number2;
    int *array;

    printf("Enter a number, please: ");
    scanf("%d", &number);

    array=(int *)malloc(sizeof(int)*(number+1));
    for(i=1; i<=number; i+=2)
      {
        array[i]=0;
      }
    array[2]=0;
    for(i=4; i<=number; i+=2)
      {
        array[i]=1;
      }
    number2=(int)sqrt(number);
    printf("%d\n", number2);
    for(i=3; i<=number2; i+=2)
      {
        if(array[i]==0)
          {
            printf("%d\n", i);
            for(j=(i*i); i<=number; j+=i)
              {
                array[j]=1;

              }
          }
      }
    printf("1 and 2 is prime number.\n");
    for(i=3; i<number; i+=2)
      {
        if(array[i]==0)
          {
            printf("%d is prime number.\n", i);
          }
      }
  }
#+end_src

* Hesaplama Kuramı
** 1. Ders

Not dağılımı: 1. vize %20 2. vize %20 ödevler %20 final %40
Devamsızlık hakkı: 12 saat ~ 4 hafta
Kitap: [[https://theswissbay.ch/pdf/Book/Introduction%2520to%2520the%2520theory%2520of%2520computation_third%2520edition%2520-%2520Michael%2520Sipser.pdf][Michael Sipser, Introduction To The Theory Of Computation 3rd Edition]]

İspat yöntemlerinden "Pidgeon Principle" çıkarmış.
* Bilgisayar Donanımı
** 1. Ders
* Yarı iletken Fiziği
** 1. Ders
* Mobil Programlamaya Giriş
** 1. Ders
[[https://docs.google.com/viewer?url=https%253A%252F%252Fwww.ce.yildiz.edu.tr%252Fpersonal%252Famacg%252Ffile%252F34465%252F18_19_Syllabus_MPG.pdf][Syllabus]]

*** 2018 Trendleri:
- Augmented Reality and Virtual Reality
- Mobile Payment
- Blockchain
- Security \rightarrow Malware \rightarrow Sandbox (malware bulmaya yarayan sanal makine)
- Wearable apps
- Instant apps
- IoT
- Cloud Based apps
- Beacon and Location-Based Services
- Chatbots
- AI
- Personalization
- Design Approach
- Cross Platform tools
** 2. Ders (yazan: Bilal Güvenç)
*** Pervasive Computing (Ubiquitous Computing)
- Ubiquitous Computing is a concept in software engineering and computer science where computing is made to appear everwhere and anywhere.
- In constrast to desktop computing, ubiquitous computing can occur using any device, in any location and in any format.

*** Mobile Computing
Mobile computing is a technology that allows transmission of data, voice and
video via a computer or any other wireless enabled device without having to be
connected to a fixed physical link.

1. Mobile Hardware
2. Mobile Software
	- Operating Systems
	- Applications
	- Security Malware
3. Mobile Communication
	- Global System for Mobile Communication (GSM)
	- (SMS)
	- Global Positioning System (GPS)
	- Internet
	- WiFi
	- Bluetooth
	- Radio

Feature Phone -> Personal Digital Assistan (PDA) -> Smartphone -> Mobile OS -> Tablet -> Wearable Tech -> Internet of Things (IoT)

*** Computer - Computer Communication
File Transfer Protocol FTP, TCP, MQTT, Qualm vs.

Human to Computer Communication
- Touch Screen
- Touch Pad
- Keyboard
- Mouse
- Microphone
- Stylus Pen
- Camera - Motion Capture
- Fingerprint

Computer to Human Communication
- Speakers
- Monitors (Screens)
- LED Lights
- Vibration

In-Site Processing
On-P… Processing
	
