README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-26 Sal 23:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>YTU CE</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Furkan Karataş" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">YTU CE</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb2a1842">Veri Yapıları</a>
<ul>
<li><a href="#org62c578d">1. Ders</a></li>
</ul>
</li>
<li><a href="#org41e061f">Hesaplama Kuramı</a>
<ul>
<li><a href="#org3f5b2a9">1. Ders</a></li>
</ul>
</li>
<li><a href="#org90dd182">Bilgisayar Donanımı</a>
<ul>
<li><a href="#orgc546bd1">1. Ders</a></li>
</ul>
</li>
<li><a href="#org822bbb3">Yarı iletken Fiziği</a>
<ul>
<li><a href="#org98e5b8b">1. Ders</a></li>
</ul>
</li>
<li><a href="#org92dc1a8">Mobil Programlamaya Giriş</a>
<ul>
<li><a href="#org427fc91">1. Ders</a>
<ul>
<li><a href="#org48dc59f">2018 Trendleri:</a></li>
</ul>
</li>
<li><a href="#org81c5d71">2. Ders (yazan: Bilal Güvenç)</a>
<ul>
<li><a href="#orgf41ab1c">Pervasive Computing (Ubiquitous Computing)</a></li>
<li><a href="#org83acfb3">Mobile Computing</a></li>
<li><a href="#orga44ef4c">Computer - Computer Communication</a></li>
<li><a href="#orgab54606">Research Topics Related to Ubiquitous Computing</a></li>
<li><a href="#orgac3ab15">Mobile Applications</a></li>
</ul>
</li>
<li><a href="#org68c4186">3. Ders</a>
<ul>
<li><a href="#org66c30a3">Mobile Development Techniques</a></li>
<li><a href="#org2db3525">Requirements of a Cross-Platform framework</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a220f8">Yöneylem Araştırması</a>
<ul>
<li><a href="#org7ef0bb8">1. Ders</a></li>
</ul>
</li>
<li><a href="#orgfcbdb77">Satış Yönetimi (Seçmeli 3)</a>
<ul>
<li><a href="#org06b7290">1. Ders</a></li>
</ul>
</li>
<li><a href="#orga770908">Yapısal Programlama</a>
<ul>
<li><a href="#orga9db9f7">Ders Bilgisi</a>
<ul>
<li><a href="#org2d0eb04">Dersin İçeriği</a></li>
<li><a href="#org8c19e97">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</a></li>
</ul>
</li>
<li><a href="#orgbbb59a2">Genel Bilgiler</a></li>
<li><a href="#org13c45df">Pointerlar</a>
<ul>
<li><a href="#org9a821e1">Pointer oluşturma</a></li>
</ul>
</li>
<li><a href="#orgaf28ae4">Function Pointers</a></li>
<li><a href="#org0d48a7b">Vize</a></li>
</ul>
</li>
<li><a href="#org29e940b">Alt Seviye Programlama</a>
<ul>
<li><a href="#org5c5c798">Ders Bilgisi</a>
<ul>
<li><a href="#org10dbfff">Dersin İçeriği</a></li>
<li><a href="#org6faf24b">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</a></li>
</ul>
</li>
<li><a href="#orgf19f500">Sayı Sistemleri</a>
<ul>
<li><a href="#org0179d6f">İki sayı düzeninde çıkarma</a></li>
<li><a href="#org1db6ec7">Octal ve Hexadecimal sayı düzeni</a></li>
</ul>
</li>
<li><a href="#org5c0a70f">Registerlar</a></li>
<li><a href="#orgec9fe04">Bayraklar(Flags)</a></li>
<li><a href="#org9d2f433">Gerçek Kipte Fiziksel Adres Hesabı</a></li>
<li><a href="#org0bc5442">Komutlar</a>
<ul>
<li><a href="#orgc53a02c">Veri Aktarım Komutları</a></li>
<li><a href="#orge75d4cd">Aritmetik Komutlar</a></li>
<li><a href="#org45c206b">Dallanma Komutları</a></li>
<li><a href="#org88dd652">Öteleme ve Döndürme Komutları</a></li>
<li><a href="#org3a422a2">Mantıksal Komutlar</a></li>
<li><a href="#orga3e92cc">Stack Komutları</a></li>
</ul>
</li>
<li><a href="#org581cbe5">Bazı kod bloklarının assemblydeki eşdeğerleri</a>
<ul>
<li><a href="#orgf0392d2">If bloğu</a></li>
<li><a href="#orgcf395cc">For bloğu</a></li>
<li><a href="#org0ae7569">While bloğu</a></li>
<li><a href="#org14aa0c1">İç içe for</a></li>
<li><a href="#org5cab572"></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge0fb8e8">Ayrık Matematik</a>
<ul>
<li><a href="#orgb4db1e8">Ders Bilgisi</a>
<ul>
<li><a href="#orga6e93cf">Dersin İçeriği</a></li>
<li><a href="#orgd9e65b3">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3810ff4">Lojik Devreler</a>
<ul>
<li><a href="#orge67fa93">Ders Bilgisi</a>
<ul>
<li><a href="#org1a00af1">Dersin İçeriği</a></li>
<li><a href="#orga68df5f">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5adb345">Sinyaller ve Sistemler</a>
<ul>
<li><a href="#org152001b">Ders Bilgisi</a>
<ul>
<li><a href="#org9ff5de1">Dersin İçeriği</a></li>
<li><a href="#orgbcaaf35">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfbd7a98">İstatistiksel Veri Analizi</a>
<ul>
<li><a href="#orgc040855">Ders Bilgisi</a>
<ul>
<li><a href="#orga875892">Dersin İçeriği</a></li>
<li><a href="#org5cb323a">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2a1842" class="outline-2">
<h2 id="orgb2a1842">Veri Yapıları</h2>
<div class="outline-text-2" id="text-orgb2a1842">
</div>
<div id="outline-container-org62c578d" class="outline-3">
<h3 id="org62c578d">1. Ders</h3>
<div class="outline-text-3" id="text-org62c578d">
<p>
Not dağılımı: (2 vize + 2 ödev + Proje + 4 lab) = %60, final = %40<br />
</p>

<p>
Soru: Verilen bir n sayısı için 1'den n'e kadar olan asal sayıları bulan<br />
algoritmayı tasarlayın.<br />
</p>

<p>
C kodu: (<a href="https://github.com/haliluluoglu/YTU-CE/blob/C-Language/Veri%20Yap%C4%B1lar%C4%B1%20ve%20Algoritmalar%C4%B1/primeNumber.c">Halil İbrahim Uluoğlu</a>)<br />
</p>
<div class="org-src-container">
<pre class="src src-C">#include &lt;stdio.h&gt;
#include &lt;math.h&gt;
#include &lt;stdlib.h&gt;

void main()
{
  int number,i,j,number2;
  int *array;

  printf("Enter a number, please: ");
  scanf("%d", &amp;number);

  array=(int *)malloc(sizeof(int)*(number+1));
  for(i=1; i&lt;=number; i+=2)
    {
      array[i]=0;
    }
  array[2]=0;
  for(i=4; i&lt;=number; i+=2)
    {
      array[i]=1;
    }
  number2=(int)sqrt(number);
  printf("%d\n", number2);
  for(i=3; i&lt;=number2; i+=2)
    {
      if(array[i]==0)
        {
          printf("%d\n", i);
          for(j=(i*i); i&lt;=number; j+=i)
            {
              array[j]=1;

            }
        }
    }
  printf("1 and 2 is prime number.\n");
  for(i=3; i&lt;number; i+=2)
    {
      if(array[i]==0)
        {
          printf("%d is prime number.\n", i);
        }
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org41e061f" class="outline-2">
<h2 id="org41e061f">Hesaplama Kuramı</h2>
<div class="outline-text-2" id="text-org41e061f">
</div>
<div id="outline-container-org3f5b2a9" class="outline-3">
<h3 id="org3f5b2a9">1. Ders</h3>
<div class="outline-text-3" id="text-org3f5b2a9">
<p>
Not dağılımı: 1. vize %20 2. vize %20 ödevler %20 final %40<br />
Devamsızlık hakkı: 12 saat ~ 4 hafta<br />
Kitap: <a href="https://theswissbay.ch/pdf/Book/Introduction%20to%20the%20theory%20of%20computation_third%20edition%20-%20Michael%20Sipser.pdf">Michael Sipser, Introduction To The Theory Of Computation 3rd Edition</a><br />
</p>

<p>
İspat yöntemlerinden "Pidgeon Principle" çıkarmış.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org90dd182" class="outline-2">
<h2 id="org90dd182">Bilgisayar Donanımı</h2>
<div class="outline-text-2" id="text-org90dd182">
</div>
<div id="outline-container-orgc546bd1" class="outline-3">
<h3 id="orgc546bd1">1. Ders</h3>
</div>
</div>
<div id="outline-container-org822bbb3" class="outline-2">
<h2 id="org822bbb3">Yarı iletken Fiziği</h2>
<div class="outline-text-2" id="text-org822bbb3">
</div>
<div id="outline-container-org98e5b8b" class="outline-3">
<h3 id="org98e5b8b">1. Ders</h3>
</div>
</div>
<div id="outline-container-org92dc1a8" class="outline-2">
<h2 id="org92dc1a8">Mobil Programlamaya Giriş</h2>
<div class="outline-text-2" id="text-org92dc1a8">
</div>
<div id="outline-container-org427fc91" class="outline-3">
<h3 id="org427fc91">1. Ders</h3>
<div class="outline-text-3" id="text-org427fc91">
<p>
<a href="https://docs.google.com/viewer?url=https%3A%2F%2Fwww.ce.yildiz.edu.tr%2Fpersonal%2Famacg%2Ffile%2F34465%2F18_19_Syllabus_MPG.pdf">Syllabus</a><br />
</p>
</div>

<div id="outline-container-org48dc59f" class="outline-4">
<h4 id="org48dc59f">2018 Trendleri:</h4>
<div class="outline-text-4" id="text-org48dc59f">
<ul class="org-ul">
<li>Augmented Reality and Virtual Reality<br /></li>
<li>Mobile Payment<br /></li>
<li>Blockchain<br /></li>
<li>Security &rarr; Malware &rarr; Sandbox (malware bulmaya yarayan sanal makine)<br /></li>
<li>Wearable apps<br /></li>
<li>Instant apps<br /></li>
<li>IoT<br /></li>
<li>Cloud Based apps<br /></li>
<li>Beacon and Location-Based Services<br /></li>
<li>Chatbots<br /></li>
<li>AI<br /></li>
<li>Personalization<br /></li>
<li>Design Approach<br /></li>
<li>Cross Platform tools<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org81c5d71" class="outline-3">
<h3 id="org81c5d71">2. Ders (yazan: Bilal Güvenç)</h3>
<div class="outline-text-3" id="text-org81c5d71">
</div>
<div id="outline-container-orgf41ab1c" class="outline-4">
<h4 id="orgf41ab1c">Pervasive Computing (Ubiquitous Computing)</h4>
<div class="outline-text-4" id="text-orgf41ab1c">
<ul class="org-ul">
<li>Ubiquitous Computing is a concept in software engineering and computer science where computing is made to appear everwhere and anywhere.<br /></li>
<li>In constrast to desktop computing, ubiquitous computing can occur using any device, in any location and in any format.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org83acfb3" class="outline-4">
<h4 id="org83acfb3">Mobile Computing</h4>
<div class="outline-text-4" id="text-org83acfb3">
<p>
Mobile computing is a technology that allows transmission of data, voice and<br />
video via a computer or any other wireless enabled device without having to be<br />
connected to a fixed physical link.<br />
</p>

<ol class="org-ol">
<li>Mobile Hardware<br /></li>
<li>Mobile Software<br />
<ul class="org-ul">
<li>Operating Systems<br /></li>
<li>Applications<br /></li>
<li>Security Malware<br /></li>
</ul></li>
<li>Mobile Communication<br />
<ul class="org-ul">
<li>Global System for Mobile Communication (GSM)<br /></li>
<li>(SMS)<br /></li>
<li>Global Positioning System (GPS)<br /></li>
<li>Internet<br /></li>
<li>WiFi<br /></li>
<li>Bluetooth<br /></li>
<li>Radio<br /></li>
</ul></li>
</ol>

<p>
Feature Phone -&gt; Personal Digital Assistan (PDA) -&gt; Smartphone -&gt; Mobile OS -&gt; Tablet -&gt; Wearable Tech -&gt; Internet of Things (IoT)<br />
</p>
</div>
</div>

<div id="outline-container-orga44ef4c" class="outline-4">
<h4 id="orga44ef4c">Computer - Computer Communication</h4>
<div class="outline-text-4" id="text-orga44ef4c">
<p>
File Transfer Protocol FTP, TCP, MQTT, Qualm vs.<br />
</p>

<p>
Human to Computer Communication<br />
</p>
<ul class="org-ul">
<li>Touch Screen<br /></li>
<li>Touch Pad<br /></li>
<li>Keyboard<br /></li>
<li>Mouse<br /></li>
<li>Microphone<br /></li>
<li>Stylus Pen<br /></li>
<li>Camera - Motion Capture<br /></li>
<li>Fingerprint<br /></li>
</ul>

<p>
Computer to Human Communication<br />
</p>
<ul class="org-ul">
<li>Speakers<br /></li>
<li>Monitors (Screens)<br /></li>
<li>LED Lights<br /></li>
<li>Vibration<br /></li>
</ul>

<p>
In-Site Processing<br />
On-P… Processing<br />
</p>
</div>
</div>
