README.org
*** Research Topics Related to Ubiquitous Computing
- Distributed Computing
- Mobile Computing
- Location Computing
- Mobile Networking
- Context-Aware Computing
- Sensor Networks
- Internet of Things
- Human-Computer Interaction
- Artificial Intelligence

Ambient Intelligence
In computing, artificial intelligence refers to electronic enviroments that are
sensitive and responsive to the presence of people.
- Embedded (Gömülü)
- Personalized (Kişiselleştirilebilir)
- Adaptive (Adapte olan)
- Anticipatery (Algılayıp adapte olan)
- Context-Awareness

Non-Intrusive
Intrusive

*** Mobile Applications
A mobile app is a computere program designed to run on smartphones, tablets,
tablet pc's and other mobile devices.

Simulation vs Emulation
A simulation is a system that behaves similar something else, but is implemented
in an entirely different way. It provides the basic behaviours of a system but
may not necessarily abide all of the rules of the system beign simulated. It is
there to give you an idea about how something works.

| Emulators                                   | Simulators                      |
|---------------------------------------------+---------------------------------|
| Written in machine-level assembly languages | Written in high-level languages |
| More suitable for debugging                 | Difficult for debugging purpose |
| Complete re-implementation                  | Partial re-implementation       |

Mobile Application Development Constraints
- Limited Battery Life
- Limited Hardware
	- CPU
	- Memory
	- Storage
- Responsiveness
- Security and Privacy
- Range, Bandwidth & Quota
- Simplicity & User Friendly 
- Transmission Interference
	- Downloading
	- Uploading
	- Streaming
- Potential Hazards

** 3. Ders
*** Mobile Development Techniques
- Native Development (SDK, NDK, Specific Hardware, Software)
- Cross-Platform Development (JS, Dart, C#, Qt, HTML, CSS...)
- Mobile Web Development (Browser, HTML, CSS, JS)
- Hybrid App Development (HTML, CSS, JS, Webkit, Native Container)

| Decision Criteria          | Native                                  | Mobile Web         | Cross-Platform                                     |
|----------------------------+-----------------------------------------+--------------------+----------------------------------------------------|
| Quality of user experience | Excellent                               | Very Good          | Not as good as Native                              |
| Quality of apps            | High                                    | Medium             | Medium to low                                      |
| Potential users            | Limited to a particular mobile platform | Maximum            | Large as it reaches to users of different platform |
| App development cost       | High                                    | Low                | Medium to low                                      |
| Security of app            | Excellent                               | Depends on browser | Not good                                           |
| Supportability             | Complex                                 | Simple             | Medium to complex                                  |
| Ease of updating           | Complex                                 | Simple             | Medium to complex                                  |
| Time-to-market             | High                                    | Medium             | Short                                              |

*** Requirements of a Cross-Platform framework
- Multiple mobile platform support
- Built-in features
- Plugin supportability
- Security
- Power Consumption
  - Resource management (Memory, Storage, Cpu)
- Open source
- Backend Communication
- Rich user interface
* Yöneylem Araştırması
** 1. Ders
* Satış Yönetimi (Seçmeli 3)
** 1. Ders
Satış
- Müşteri noktasında satış
- Satışçı

Satışlar
- Küçük satışlar
- Büyük satışlar
- Stratejik satışlar

Pazarlama
Bireysel ve örgütsel amaçlara ulaşmak üzere değişime konu olacak malların,
hizmetlerin, fikirlerin, çözümlerin(ürün) geliştirilmesi, fiyatlandırılması,
dağıtırlması ve tutundurulması ile ilgili planlama ve uygulama sürecidir.
* Yapısal Programlama
** Ders Bilgisi
*** Dersin İçeriği

C Programlama Dilinde Veri Tipleri ; Kontrol Deyimleri ; Döngüler ; Diziler ve İşaretçiler ;
Çok Boyutlu Diziler ; İşaretçi Dizileri ; Karakter Dizileri ; Dinamik Bellek Yönetimi ;
Fonksiyonlar ; Fonksiyon İşaretçileri ; Özyinelemeli Fonksiyonlar ; Yerel ve Global Değişkenler ;
Yapılar ; Bitsel İşlemler ; Dosya İşlemleri ; C Önişlemcileri ; Makrolar ; C için Veri Yapıları ;
Linkli Listeler ; Statik ve Dinamik Kütüphaneler.

