README.html

<div id="outline-container-orgab54606" class="outline-4">
<h4 id="orgab54606">Research Topics Related to Ubiquitous Computing</h4>
<div class="outline-text-4" id="text-orgab54606">
<ul class="org-ul">
<li>Distributed Computing<br /></li>
<li>Mobile Computing<br /></li>
<li>Location Computing<br /></li>
<li>Mobile Networking<br /></li>
<li>Context-Aware Computing<br /></li>
<li>Sensor Networks<br /></li>
<li>Internet of Things<br /></li>
<li>Human-Computer Interaction<br /></li>
<li>Artificial Intelligence<br /></li>
</ul>

<p>
Ambient Intelligence<br />
In computing, artificial intelligence refers to electronic enviroments that are<br />
sensitive and responsive to the presence of people.<br />
</p>
<ul class="org-ul">
<li>Embedded (Gömülü)<br /></li>
<li>Personalized (Kişiselleştirilebilir)<br /></li>
<li>Adaptive (Adapte olan)<br /></li>
<li>Anticipatery (Algılayıp adapte olan)<br /></li>
<li>Context-Awareness<br /></li>
</ul>

<p>
Non-Intrusive<br />
Intrusive<br />
</p>
</div>
</div>

<div id="outline-container-orgac3ab15" class="outline-4">
<h4 id="orgac3ab15">Mobile Applications</h4>
<div class="outline-text-4" id="text-orgac3ab15">
<p>
A mobile app is a computere program designed to run on smartphones, tablets,<br />
tablet pc's and other mobile devices.<br />
</p>

<p>
Simulation vs Emulation<br />
A simulation is a system that behaves similar something else, but is implemented<br />
in an entirely different way. It provides the basic behaviours of a system but<br />
may not necessarily abide all of the rules of the system beign simulated. It is<br />
there to give you an idea about how something works.<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Emulators</th>
<th scope="col" class="org-left">Simulators</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Written in machine-level assembly languages</td>
<td class="org-left">Written in high-level languages</td>
</tr>

<tr>
<td class="org-left">More suitable for debugging</td>
<td class="org-left">Difficult for debugging purpose</td>
</tr>

<tr>
<td class="org-left">Complete re-implementation</td>
<td class="org-left">Partial re-implementation</td>
</tr>
</tbody>
</table>

<p>
Mobile Application Development Constraints<br />
</p>
<ul class="org-ul">
<li>Limited Battery Life<br /></li>
<li>Limited Hardware<br />
<ul class="org-ul">
<li>CPU<br /></li>
<li>Memory<br /></li>
<li>Storage<br /></li>
</ul></li>
<li>Responsiveness<br /></li>
<li>Security and Privacy<br /></li>
<li>Range, Bandwidth &amp; Quota<br /></li>
<li>Simplicity &amp; User Friendly<br /></li>
<li>Transmission Interference<br />
<ul class="org-ul">
<li>Downloading<br /></li>
<li>Uploading<br /></li>
<li>Streaming<br /></li>
</ul></li>
<li>Potential Hazards<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org68c4186" class="outline-3">
<h3 id="org68c4186">3. Ders</h3>
<div class="outline-text-3" id="text-org68c4186">
</div>
<div id="outline-container-org66c30a3" class="outline-4">
<h4 id="org66c30a3">Mobile Development Techniques</h4>
<div class="outline-text-4" id="text-org66c30a3">
<ul class="org-ul">
<li>Native Development (SDK, NDK, Specific Hardware, Software)<br /></li>
<li>Cross-Platform Development (JS, Dart, C#, Qt, HTML, CSS&#x2026;)<br /></li>
<li>Mobile Web Development (Browser, HTML, CSS, JS)<br /></li>
<li>Hybrid App Development (HTML, CSS, JS, Webkit, Native Container)<br /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Decision Criteria</th>
<th scope="col" class="org-left">Native</th>
<th scope="col" class="org-left">Mobile Web</th>
<th scope="col" class="org-left">Cross-Platform</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Quality of user experience</td>
<td class="org-left">Excellent</td>
<td class="org-left">Very Good</td>
<td class="org-left">Not as good as Native</td>
</tr>

<tr>
<td class="org-left">Quality of apps</td>
<td class="org-left">High</td>
<td class="org-left">Medium</td>
<td class="org-left">Medium to low</td>
</tr>

<tr>
<td class="org-left">Potential users</td>
<td class="org-left">Limited to a particular mobile platform</td>
<td class="org-left">Maximum</td>
<td class="org-left">Large as it reaches to users of different platform</td>
</tr>

<tr>
<td class="org-left">App development cost</td>
<td class="org-left">High</td>
<td class="org-left">Low</td>
<td class="org-left">Medium to low</td>
</tr>

<tr>
<td class="org-left">Security of app</td>
<td class="org-left">Excellent</td>
<td class="org-left">Depends on browser</td>
<td class="org-left">Not good</td>
</tr>

<tr>
<td class="org-left">Supportability</td>
<td class="org-left">Complex</td>
<td class="org-left">Simple</td>
<td class="org-left">Medium to complex</td>
</tr>

<tr>
<td class="org-left">Ease of updating</td>
<td class="org-left">Complex</td>
<td class="org-left">Simple</td>
<td class="org-left">Medium to complex</td>
</tr>

<tr>
<td class="org-left">Time-to-market</td>
<td class="org-left">High</td>
<td class="org-left">Medium</td>
<td class="org-left">Short</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2db3525" class="outline-4">
<h4 id="org2db3525">Requirements of a Cross-Platform framework</h4>
<div class="outline-text-4" id="text-org2db3525">
<ul class="org-ul">
<li>Multiple mobile platform support<br /></li>
<li>Built-in features<br /></li>
<li>Plugin supportability<br /></li>
<li>Security<br /></li>
<li>Power Consumption<br />
<ul class="org-ul">
<li>Resource management (Memory, Storage, Cpu)<br /></li>
</ul></li>
<li>Open source<br /></li>
<li>Backend Communication<br /></li>
<li>Rich user interface<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org7a220f8" class="outline-2">
<h2 id="org7a220f8">Yöneylem Araştırması</h2>
<div class="outline-text-2" id="text-org7a220f8">
</div>
<div id="outline-container-org7ef0bb8" class="outline-3">
<h3 id="org7ef0bb8">1. Ders</h3>
</div>
</div>
<div id="outline-container-orgfcbdb77" class="outline-2">
<h2 id="orgfcbdb77">Satış Yönetimi (Seçmeli 3)</h2>
<div class="outline-text-2" id="text-orgfcbdb77">
</div>
<div id="outline-container-org06b7290" class="outline-3">
<h3 id="org06b7290">1. Ders</h3>
<div class="outline-text-3" id="text-org06b7290">
<p>
Satış<br />
</p>
<ul class="org-ul">
<li>Müşteri noktasında satış<br /></li>
<li>Satışçı<br /></li>
</ul>

<p>
Satışlar<br />
</p>
<ul class="org-ul">
<li>Küçük satışlar<br /></li>
<li>Büyük satışlar<br /></li>
<li>Stratejik satışlar<br /></li>
</ul>

<p>
Pazarlama<br />
Bireysel ve örgütsel amaçlara ulaşmak üzere değişime konu olacak malların,<br />
hizmetlerin, fikirlerin, çözümlerin(ürün) geliştirilmesi, fiyatlandırılması,<br />
dağıtırlması ve tutundurulması ile ilgili planlama ve uygulama sürecidir.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orga770908" class="outline-2">
<h2 id="orga770908">Yapısal Programlama</h2>
<div class="outline-text-2" id="text-orga770908">
</div>
<div id="outline-container-orga9db9f7" class="outline-3">
<h3 id="orga9db9f7">Ders Bilgisi</h3>
<div class="outline-text-3" id="text-orga9db9f7">
</div>
<div id="outline-container-org2d0eb04" class="outline-4">
<h4 id="org2d0eb04">Dersin İçeriği</h4>
<div class="outline-text-4" id="text-org2d0eb04">
<p>
C Programlama Dilinde Veri Tipleri ; Kontrol Deyimleri ; Döngüler ; Diziler ve İşaretçiler ;<br />
Çok Boyutlu Diziler ; İşaretçi Dizileri ; Karakter Dizileri ; Dinamik Bellek Yönetimi ;<br />
Fonksiyonlar ; Fonksiyon İşaretçileri ; Özyinelemeli Fonksiyonlar ; Yerel ve Global Değişkenler ;<br />
Yapılar ; Bitsel İşlemler ; Dosya İşlemleri ; C Önişlemcileri ; Makrolar ; C için Veri Yapıları ;<br />
Linkli Listeler ; Statik ve Dinamik Kütüphaneler.<br />
</p>
</div>
</div>
