README.org
*** Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları

| Hafta | Konular                                                                                        |
|-------+------------------------------------------------------------------------------------------------|
| <c>   | <l>                                                                                            |
| 1     | C Programlama Dilinde Veri Tipleri / Kontrol Deyimleri / Döngüler                              |
| 2     | Diziler / İşaretçiler / İşaretçiler Aritmetiği                                                 |
| 3     | Çok Boyutlu Diziler / İşaretçi Dizileri / Karakter Dizileri / İşaretçilerin İşaretçisi	 |
| 4     | Dinamik Bellek Yönetimi ve Fonksiyonlar                                                        |
| 5     | Fonksiyon İşaretçileri / Özyinelemeli Fonksiyonlar                                             |
| 6     | Yerel ve Global Değişkenler / Depolayıcı Sınıflar                                              |
| 7     | Yapılar / Birlikler / Bitsel İşlemler                                                          |
| 8     | Temel Dosya İşlemleri                                                                          |
| 9     | Ara Sınav 1                                                                                    |
| 10    | İleri Dosya İşlemleri                                                                          |
| 11    | C Önişlemcileri ve Makrolar                                                                    |
| 12    | Linkli Listeler                                                                                |
| 13    | Ara Sınav 2                                                                                    |
| 14    | Statik ve Dinamik Kütüphaneler                                                                 |
| 15    | Final                                                                                          |

** Genel Bilgiler

printf() ve scanf() fonksiyonlarında kullanılan veri tipi sembolleri

| Sembol | Veri Tipi             |
|--------+-----------------------|
| %c     | char                  |
| %d     | integer               |
| %s     | string                |
| %ld    | long integer          |
| %u     | unsigned integer      |
| %lu    | unsigned long integer |
| %f     | float                 |
| %lf    | double                |
| %x     | hexadecimal           |
| %p     | address               |

Bit manipulation operators

| Operator           | Symbol | Form      | Result                    |
|--------------------+--------+-----------+---------------------------|
| right shift        | >>     | x >> y    | x shifted right by y bits |
| left shift         | <<     | x << y    | x shifted left by y bits  |
| bitwise AND        | &      | x & y     | x bitwise ANDed with y    |
| bitwise OR         | \vert  | x \vert y | x bitwise ORed with y     |
| bitwise XOR        | ^      | x ^ y     | x bitwise XORed with y    |
| bitwise complement | ~      | ~x        | bitwise complement of x   |

** Pointerlar
*** Pointer oluşturma
**** Birinci dereceden pointer

Diziler, stringler(char dizisi) veya tek elemanlar için kullanılır.

#+BEGIN_SRC C
  void main(){
  int *p; //rastgele adres atanır, if(p) == if(non-zero) olur.
  int *p2 = NULL; //adresi 0 olur, null pointer denir, if(p) == if(zero) olur.
  char *char_p; // sizeof(*p) ve sizeof(*char_p) aynıdır. Adresin hafızada kapladığı
    // alan pointerın işaret ettiği veri tipinden bağımsızdır.
  double pi = 3.14;
  // pi değişkenine pointer atamak için 2 yol:
  double *dp = &pi; 

  double *dp2;
  ,*dp2 = pi;  // dp2 = &pi de olur.

  int dizi[5] = {1,2,3,4,5};
  p = dizi; // p = dizi[0] da olur.
  printf("%d, %d", *p, *(p + 1)); //çıktısı: 1, 2
  ,*p++;   // işaret edilen sayıyı değil adresi arttırır.
  ,*(p++); // sayıyı arttırır.
  }
#+END_SRC

Pointerlar için [[Dynamic][dinamik olarak hafıza açma]]


#+BEGIN_SRC C
#include <stdio.h>
#include <stdlib.h> //malloc, calloc gibi fonksiyonlar bu kütüphanede.

void main(){
int *p = NULL, elemanSayisi = 5;
p = (int *) malloc(elemanSayisi * sizeof(int));
p = malloc(elemanSayisi * sizeof *p) // böyle yapmak daha makbulmüş. Yani cast yapmamak ve
                                     // sizeof(int) yerine sizeof *p kullanmak. Evet parantezsiz kullanılıyor.

// Direk pointer oluştururken de yapılabilir:
char *cp = calloc(50, sizeof(char)); // char pointer icin calloc kullanmakta fayda var,
                                      // string alırken stringin sonunun null ile bitmesini sağlar.

}
#+END_SRC
**** <<Dynamic>>Dynamic memory allocation

Runtime sırasında hafıza açmaya yarar. Dynamic memory allocation fonksiyonlarını kullanabilmek için stdlib.h
kütüphanesi include edilmedilir.

| Function | Description                                                                              | Syntax                                 |
|----------+------------------------------------------------------------------------------------------+----------------------------------------|
| malloc   | allocates the specified number of bytes                                                  | p = malloc (number *sizeof(int));      |
| calloc   | allocates the specified number of bytes and initializes them to zero                     | p = calloc (number, sizeof(int));      |
| realloc  | increases or decreases the size of the specified block of memory, moving it if necessary | p = realloc (p, number * sizeof(int)); |
| free     | releases the specified block of memory back to the system                                | free(p);                               |

**** Double pointer

Matrisler ve string dizileri(char matrisi gibi de düşünülebilir. stringler 1 pointer geriden geliyor.) için kullanılır.

#+BEGIN_SRC C
void main(){
int **matrix = NULL;

}
#+END_SRC
