README.html

<div id="outline-container-org8c19e97" class="outline-4">
<h4 id="org8c19e97">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</h4>
<div class="outline-text-4" id="text-org8c19e97">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Hafta</th>
<th scope="col" class="org-left">Konular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-left">C Programlama Dilinde Veri Tipleri / Kontrol Deyimleri / Döngüler</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-left">Diziler / İşaretçiler / İşaretçiler Aritmetiği</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-left">Çok Boyutlu Diziler / İşaretçi Dizileri / Karakter Dizileri / İşaretçilerin İşaretçisi</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-left">Dinamik Bellek Yönetimi ve Fonksiyonlar</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-left">Fonksiyon İşaretçileri / Özyinelemeli Fonksiyonlar</td>
</tr>

<tr>
<td class="org-center">6</td>
<td class="org-left">Yerel ve Global Değişkenler / Depolayıcı Sınıflar</td>
</tr>

<tr>
<td class="org-center">7</td>
<td class="org-left">Yapılar / Birlikler / Bitsel İşlemler</td>
</tr>

<tr>
<td class="org-center">8</td>
<td class="org-left">Temel Dosya İşlemleri</td>
</tr>

<tr>
<td class="org-center">9</td>
<td class="org-left">Ara Sınav 1</td>
</tr>

<tr>
<td class="org-center">10</td>
<td class="org-left">İleri Dosya İşlemleri</td>
</tr>

<tr>
<td class="org-center">11</td>
<td class="org-left">C Önişlemcileri ve Makrolar</td>
</tr>

<tr>
<td class="org-center">12</td>
<td class="org-left">Linkli Listeler</td>
</tr>

<tr>
<td class="org-center">13</td>
<td class="org-left">Ara Sınav 2</td>
</tr>

<tr>
<td class="org-center">14</td>
<td class="org-left">Statik ve Dinamik Kütüphaneler</td>
</tr>

<tr>
<td class="org-center">15</td>
<td class="org-left">Final</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgbbb59a2" class="outline-3">
<h3 id="orgbbb59a2">Genel Bilgiler</h3>
<div class="outline-text-3" id="text-orgbbb59a2">
<p>
printf() ve scanf() fonksiyonlarında kullanılan veri tipi sembolleri<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sembol</th>
<th scope="col" class="org-left">Veri Tipi</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">%c</td>
<td class="org-left">char</td>
</tr>

<tr>
<td class="org-left">%d</td>
<td class="org-left">integer</td>
</tr>

<tr>
<td class="org-left">%s</td>
<td class="org-left">string</td>
</tr>

<tr>
<td class="org-left">%ld</td>
<td class="org-left">long integer</td>
</tr>

<tr>
<td class="org-left">%u</td>
<td class="org-left">unsigned integer</td>
</tr>

<tr>
<td class="org-left">%lu</td>
<td class="org-left">unsigned long integer</td>
</tr>

<tr>
<td class="org-left">%f</td>
<td class="org-left">float</td>
</tr>

<tr>
<td class="org-left">%lf</td>
<td class="org-left">double</td>
</tr>

<tr>
<td class="org-left">%x</td>
<td class="org-left">hexadecimal</td>
</tr>

<tr>
<td class="org-left">%p</td>
<td class="org-left">address</td>
</tr>
</tbody>
</table>

<p>
Bit manipulation operators<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Symbol</th>
<th scope="col" class="org-left">Form</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">right shift</td>
<td class="org-left">&gt;&gt;</td>
<td class="org-left">x &gt;&gt; y</td>
<td class="org-left">x shifted right by y bits</td>
</tr>

<tr>
<td class="org-left">left shift</td>
<td class="org-left">&lt;&lt;</td>
<td class="org-left">x &lt;&lt; y</td>
<td class="org-left">x shifted left by y bits</td>
</tr>

<tr>
<td class="org-left">bitwise AND</td>
<td class="org-left">&amp;</td>
<td class="org-left">x &amp; y</td>
<td class="org-left">x bitwise ANDed with y</td>
</tr>

<tr>
<td class="org-left">bitwise OR</td>
<td class="org-left">&vert;</td>
<td class="org-left">x &vert; y</td>
<td class="org-left">x bitwise ORed with y</td>
</tr>

<tr>
<td class="org-left">bitwise XOR</td>
<td class="org-left">^</td>
<td class="org-left">x ^ y</td>
<td class="org-left">x bitwise XORed with y</td>
</tr>

<tr>
<td class="org-left">bitwise complement</td>
<td class="org-left">~</td>
<td class="org-left">~x</td>
<td class="org-left">bitwise complement of x</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org13c45df" class="outline-3">
<h3 id="org13c45df">Pointerlar</h3>
<div class="outline-text-3" id="text-org13c45df">
</div>
<div id="outline-container-org9a821e1" class="outline-4">
<h4 id="org9a821e1">Pointer oluşturma</h4>
<div class="outline-text-4" id="text-org9a821e1">
</div>
<ul class="org-ul">
<li><a id="org0964605"></a>Birinci dereceden pointer<br />
<div class="outline-text-5" id="text-org0964605">
<p>
Diziler, stringler(char dizisi) veya tek elemanlar için kullanılır.<br />
</p>

<div class="org-src-container">
<pre class="src src-C">void main(){
int *p; //rastgele adres atanır, if(p) == if(non-zero) olur.
int *p2 = NULL; //adresi 0 olur, null pointer denir, if(p) == if(zero) olur.
char *char_p; // sizeof(*p) ve sizeof(*char_p) aynıdır. Adresin hafızada kapladığı
  // alan pointerın işaret ettiği veri tipinden bağımsızdır.
double pi = 3.14;
// pi değişkenine pointer atamak için 2 yol:
double *dp = &amp;pi; 

double *dp2;
*dp2 = pi;  // dp2 = &amp;pi de olur.

int dizi[5] = {1,2,3,4,5};
p = dizi; // p = dizi[0] da olur.
printf("%d, %d", *p, *(p + 1)); //çıktısı: 1, 2
*p++;   // işaret edilen sayıyı değil adresi arttırır.
*(p++); // sayıyı arttırır.
}
</pre>
</div>

<p>
Pointerlar için <a href="#org5b75510">dinamik olarak hafıza açma</a><br />
</p>


<div class="org-src-container">
<pre class="src src-C">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt; //malloc, calloc gibi fonksiyonlar bu kütüphanede.

void main(){
int *p = NULL, elemanSayisi = 5;
p = (int *) malloc(elemanSayisi * sizeof(int));
p = malloc(elemanSayisi * sizeof *p) // böyle yapmak daha makbulmüş. Yani cast yapmamak ve
                                     // sizeof(int) yerine sizeof *p kullanmak. Evet parantezsiz kullanılıyor.

// Direk pointer oluştururken de yapılabilir:
char *cp = calloc(50, sizeof(char)); // char pointer icin calloc kullanmakta fayda var,
                                      // string alırken stringin sonunun null ile bitmesini sağlar.

}
</pre>
</div>
</div>
</li>
<li><a id="orgddb2d36"></a><a id="org5b75510"></a>Dynamic memory allocation<br />
<div class="outline-text-5" id="text-orgddb2d36">
<p>
Runtime sırasında hafıza açmaya yarar. Dynamic memory allocation fonksiyonlarını kullanabilmek için stdlib.h<br />
kütüphanesi include edilmedilir.<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Syntax</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">malloc</td>
<td class="org-left">allocates the specified number of bytes</td>
<td class="org-left">p = malloc (number *sizeof(int));</td>
</tr>

<tr>
<td class="org-left">calloc</td>
<td class="org-left">allocates the specified number of bytes and initializes them to zero</td>
<td class="org-left">p = calloc (number, sizeof(int));</td>
</tr>

<tr>
<td class="org-left">realloc</td>
<td class="org-left">increases or decreases the size of the specified block of memory, moving it if necessary</td>
<td class="org-left">p = realloc (p, number * sizeof(int));</td>
</tr>

<tr>
<td class="org-left">free</td>
<td class="org-left">releases the specified block of memory back to the system</td>
<td class="org-left">free(p);</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org35baa7b"></a>Double pointer<br />
<div class="outline-text-5" id="text-org35baa7b">
<p>
Matrisler ve string dizileri(char matrisi gibi de düşünülebilir. stringler 1 pointer geriden geliyor.) için kullanılır.<br />
</p>

<div class="org-src-container">
<pre class="src src-C">void main(){
int **matrix = NULL;

}
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
