README.org
** Function Pointers

Basit bir toplama fonksiyonu:

#+BEGIN_SRC C
  int topla (int a, int b){
      return a + b;
  }
#+END_SRC

Function pointer ile kullanımı:

#+BEGIN_SRC C
  #include <stdio.h>

  void main(){
      int (* functionPointer)(); // integer değer döndüren (return) bir fonksiyonu
				 // işaret eden pointer.
    //int (* functionPointer)(int, int); // böyle de yazılabilir.
    //int (* functionPointer)() = topla // initialization
      functionPointer = topla;
    //functionPointer = &topla; // böyle de yazılabilir.
      int sum;
      sum = (* functionPointer)(5, 10);
    //sum = functionPointer(5, 10); // böyle de yazılabilir. hoca üstteki iyi dedi.
      printf("%d", sum); // result 15
      return 0;
  }
#+END_SRC

Not: İşaret edilecek fonksiyonun dönüş tipi ile pointerın tipi uyuşmalı. int topla(int a, int, b) fonksiyonunu char (* fp)(); ile point edemiyoruz.

