README.html
<div id="outline-container-orgaf28ae4" class="outline-3">
<h3 id="orgaf28ae4">Function Pointers</h3>
<div class="outline-text-3" id="text-orgaf28ae4">
<p>
Basit bir toplama fonksiyonu:<br />
</p>

<div class="org-src-container">
<pre class="src src-C">int topla (int a, int b){
    return a + b;
}
</pre>
</div>

<p>
Function pointer ile kullanımı:<br />
</p>

<div class="org-src-container">
<pre class="src src-C">#include &lt;stdio.h&gt;

void main(){
    int (* functionPointer)(); // integer değer döndüren (return) bir fonksiyonu
       // işaret eden pointer.
  //int (* functionPointer)(int, int); // böyle de yazılabilir.
  //int (* functionPointer)() = topla // initialization
    functionPointer = topla;
  //functionPointer = &amp;topla; // böyle de yazılabilir.
    int sum;
    sum = (* functionPointer)(5, 10);
  //sum = functionPointer(5, 10); // böyle de yazılabilir. hoca üstteki iyi dedi.
    printf("%d", sum); // result 15
    return 0;
}
</pre>
</div>

<p>
Not: İşaret edilecek fonksiyonun dönüş tipi ile pointerın tipi uyuşmalı. int topla(int a, int, b) fonksiyonunu char (* fp)(); ile point edemiyoruz.<br />
</p>
</div>
</div>
