README.html

<div id="outline-container-org0d48a7b" class="outline-3">
<h3 id="org0d48a7b">Vize</h3>
<div class="outline-text-3" id="text-org0d48a7b">
<div class="org-src-container">
<pre class="src src-C">void myStrcpyV3(char *str1,char *str2)
{
  while(*str2++=*str1++);	//An assignment expression has the value of the left operand after the assignment

}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C">typedef struct{
 char OGR_isim[15] , OGR_soyisim[20]; 
 short OGR_yas;
 float OGR_puan; 
}OGR; // ogr tipi oluþturulur. bu tipden yeni degiskenler uretilebilir
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
/*
typedef struct{
 char gun;
 char ay;
 char yil;	
} TARIH;	//typedef ile tanimlandigi icin tarih tipi baska structure lar icinde de kullanilabilir

typedef struct{
 char isim[30];
 int maas; 
 TARIH tarih;
}CALISAN; 
*/

/*
vtypedef struct {
 char isim[30];
 int maas; 
 struct {
  char gun;
  char ay;
  char yil;
 }tarih;		// sadece bir kez kullanilabilir

}CALISAN; 
*/


struct CALISAN{
 char isim[30];
 int maas; 
 struct {
  char gun;
  char ay;
  char yil;
 }tarih;		// sadece bir kez kullanilabilir
}; 


/*  ILLEGAL KULLANIM (tarih struct'indan bir deðiþken uretilmeli)
struct CALISAN{
 char isim[30];
 int maas; 
 struct tarih{
  char gun;
  char ay;
  char yil;
 };		// sadece bir kez kullanilabilir
};
*/

int main()
{
  //CALISAN calisan2={"ali",7000,{11,10,90}}; //typedef ile tanimlanmissa
  //CALISAN calisan1;							//typedef ile tanimlanmissa
  struct CALISAN calisan1;
  calisan1.tarih.ay=2;
  calisan1.tarih.gun=12;
  calisan1.tarih.yil=98;
  return 0;
}


</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"># include &lt;stdio.h&gt;
# include &lt;stdlib.h&gt;
int main()
{
  int sum,sub;
  int addInt(int, int);
  int subInt(int, int);
    /*int (**foo_ptr_array)();
    foo_ptr_array = calloc( 2, sizeof( int (*)() ) );*/

  /* or */
  int (**foo_ptr_array)() = (int (**)())calloc( 2, sizeof( int (*)() ) );

  /* or */
  /* int (*foo_ptr_array[2])();  
  */

  foo_ptr_array[0] = addInt;
  foo_ptr_array[1] = subInt;
  sum=(*foo_ptr_array[0])( 1,2 );
  sub=foo_ptr_array[1]( 1,2 );

  printf("sum:%d sub:%d\n",sum,sub);
}

int addInt(int n, int m) {
    return n+m;
}

int subInt(int n, int m) {
    return n-m;
}



</pre>
</div>

<div class="org-src-container">
<pre class="src src-C">/*16 soruluk yes/no testi yapýlýyor */
/* cevap anahtarýný y/n þekline al 16bitlik answers'da tut */
/* short olarak kiþinin verdiði cevabý al*/
/* kaç soru bildiðini short olarak yaz*/
#include &lt;stdio.h&gt;
int main()
{ 
  unsigned short correctanswers = 0,answer2=0,testanswer,result; 
  short int j,score=0; 
  char c; 
  printf("sizeof short %d\n",sizeof(j));
  /* eger ilk soru en sol bitte tutuluyorsa*/
  /*for (j=0; j &lt;= 15; j++)
  { 
    scanf ("%c", &amp;c); 
    if (c == 'y' || c == 'Y') 
    {
      answer2=1&lt;&lt;(15-j);
      correctanswers = answer2 | correctanswers;
      answer2=0;
    }
  }
  */
  /* eger ilk soru en sað bitte tutuluyorsa*/
  answer2=1;
  for (j=0; j &lt;= 15; j++)
  { 
    c=getch();
    putch(c);
    if (c == 'y' || c == 'Y') 
      correctanswers = answer2 | correctanswers;
    answer2&lt;&lt;=1;
  }


  printf( "Correct answers :%d\n",correctanswers);
  printf("Kullanýcýnýn verdiði cevaplar?\n");
  scanf("%d",&amp;testanswer);
  result=testanswer^correctanswers;  //aynýysa 0 farklýysa 1
  printf("result:%d",result);
  answer2=1;
  for (j=0; j &lt;= 15; j++)
  { 
    if (answer2&amp;result)
      score++;
    answer2=answer2&lt;&lt;1;
  }
  printf("score:%d\n",16-score);

}

</pre>
</div>

<p>
LİNKED LİST<br />
</p>
<div class="org-src-container">
<pre class="src src-C">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

struct node{
    int val;
    struct node *next;
};

void push(struct node *, int);
struct node *pushFront(struct node *, int);
void list(struct node *);
void deleteNode(struct node *, int);

int main()
{
  struct node *head, *newHead, *dummy;
  int num;
  head = malloc(sizeof(struct node));
  if (head == NULL) {
      return 0;
  }	

  printf("listenin sonuna eklenmek uzere eleman veriniz\n");
    scanf("%d",&amp;num);
  head-&gt;val = num;
  head-&gt;next = NULL;

  printf("listenin sonuna eklenmek uzere eleman veriniz\n");
    scanf("%d",&amp;num);
  push(head,num);

  printf("listenin sonuna eklenmek uzere eleman veriniz\n");
    scanf("%d",&amp;num);
  push(head,num);

  printf("listenin sonuna eklenmek uzere eleman veriniz\n");
    scanf("%d",&amp;num);
  push(head,num);

  list(head);

  printf("listenin basina eklenmek uzere eleman veriniz\n");
    scanf("%d",&amp;num);
  newHead=pushFront(head,num);
  list(newHead);

  printf("listeden silinecek elemani veriniz\n");
  scanf("%d",&amp;num);
  if (num==newHead-&gt;val)
  {
    dummy=newHead-&gt;next;
    free(newHead);
    newHead=dummy;
  }
  else
    deleteNode(newHead,num);
  list(newHead);


  return 0;

}

// listenin sonuna node ekler
void push(struct node *head, int val) {
    struct node* current = head;
    while (current-&gt;next != NULL) {
        current = current-&gt;next;
    }

    current-&gt;next = malloc(sizeof(struct node));  	
    current-&gt;next-&gt;val = val;					
    current-&gt;next-&gt;next = NULL;					
}

// elemanlarý listeler
void list(struct node *head)
{
  struct node* current = head;
    printf("liste elemanlari:\n");
  while (current-&gt;next != NULL) {
      printf("-%d-",current-&gt;val);
        current = current-&gt;next;
    }
    printf("-%d-\n",current-&gt;val);
}

// listenin baþýna node ekler
struct node* pushFront(struct node *head, int val) {
    struct node* newN;
  newN=malloc(sizeof(struct node)); 
  newN-&gt;next =head;
  newN-&gt;val =val;
    return newN;
}

// elemanlarý listeler
void deleteNode(struct node *head, int val)
{
  struct node* current = head, *before=NULL;

    while ((current-&gt;val != val)&amp;&amp;(current-&gt;next != NULL))
  {
      before=current;
    current = current-&gt;next;
  }

    if (current-&gt;next == NULL)
      printf("silinmek istenen eleman listede yok\n");
    else
    {
      before-&gt;next=current-&gt;next;
      free (current);
  }

}


</pre>
</div>

<p>
lab:<br />
</p>

<div class="org-src-container">
<pre class="src src-C">#include&lt;stdio.h&gt;
#include&lt;stdlib.h&gt;
#include&lt;math.h&gt;

typedef struct point {
   int x,y;
}POINT ;
void WRITE(POINT *p,int N);
void SORT(POINT *p,int N,int (*compare)( int a, int b ));

int ascending( int a, int b ){
   return b &lt; a;   /* swap if b is less than a */
}

int descending( int a, int b ){
   return b &gt; a;   /* swap if b is greater than a */
}

void main() {
   srand(time(NULL));
   int N;
   int i, j;
   int order;
   printf("Enter N:"); scanf("%d",&amp;N);
   POINT *p=(POINT*)malloc(N*sizeof(POINT));
   printf( "Enter 1 to sort in ascending order,\n"
           "Enter 2 to sort in descending order: " );
   scanf("%d",  &amp;order );

   for (i = 0; i &lt; N; i++) {
      (p+i)-&gt;x=rand()%9+1;
      (p+i)-&gt;y=rand()%9+1;
   }
   printf("BEFORE\n");
   WRITE(p,N); 
   printf("AFTER\n");  
   if ( order == 1 ) {
      SORT( p, N, ascending );
   }
   else { /* pass function descending */
      SORT( p, N, descending );
   }

   WRITE(p,N);
   getch();
}

void WRITE(POINT *p,int N){
  int i=0;	
  printf("X - Y \n");
  printf("------\n");
  for (i = 0; i &lt; N; i++) 
    printf("%d - %d \n",(p+i)-&gt;x,(p+i)-&gt;y);
}

void SORT(POINT *p,int N,int (*compare)( int a, int b )){
  int i=0, j=0;
  int X=0,Y=0;
  POINT temp;
  for (i = 1; i &lt; N; i++)
      for (j = 0; j &lt; N - i; j++) {
         X=pow(p[j].x,2)+pow(p[j].y,2);
         Y=pow(p[j+1].x,2)+pow(p[j+1].y,2);
     if ((*compare)( X,Y )) {
            temp = p[j];
            p[j] = p[j+1];
            p[j+1] = temp;
         }
      } 
}

</pre>
</div>
</div>
</div>
</div>
