README.org
*** Dersin İçeriği

Intel 80x86 Ailesi İşlemci Mimarisi; Yazmaçlar ve Görevleri; Bayraklar; Komutlar (Mnemonic);
Adresleme Kipleri; Sözde (Pseudo) Komutlar; EXE ve COM Tipi Programlar;
Yordam ve Yordam Çağırma, Makrolar, Kesim Birleştirme; Yordamlara Parametre Aktarımı;
Kesmeler; Yüksek Seviyeli Diller ile Bağlantılar.

*** Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları

| Hafta | Konular                                                                                                                                |
|-------+----------------------------------------------------------------------------------------------------------------------------------------|
| <c>   | <l>                                                                                                                                    |
| 1     | Alt seviye dilinin özellikleri, sayı ve kodlama sistemleri, 80x86 ailesi işlemcileri, yazmaçları ve bayrakları ile kesim organizasyonu |
| 2     | Komutlar (veri aktarımı, aritmetik ve dallanma)                                                                                        |
| 3     | Komutlar (çevrim, bayraklar, mantıksal, öteleme, döndürme)                                                                             |
| 4     | Komutlar (katar işlemleri, ön ekler)                                                                                                   |
| 5     | Adresleme modları, alt seviye programlama araçları, sözde komutlar                                                                     |
| 6     | Çalışma ortamının hazırlanması ve debug kullanımı                                                                                      |
| 7     | EXE tipinde alt seviye programlama                                                                                                     |
| 8     | COM tipinde alt seviye programlama                                                                                                     |
| 9     | Ara Sınav 1                                                                                                                            |
| 10    | Yordam ve macro kullanımları                                                                                                           |
| 11    | Alt-programlar ve parametre aktarma yöntemleri                                                                                         |
| 12    | Ortak kesim kullanımı ve EXTRN/PUBLIC tanımlamaları                                                                                    |
| 13    | Ara Sınav 2                                                                                                                            |
| 14    | Kesme, vectör tablosu ve alt seviye programlama dilinin yüksek seviyeli diller ile birlikte kullanılması                               |
| 15    | Final                                                                                                                                  |

** Sayı Sistemleri
*** İki sayı düzeninde çıkarma

Onluk tabandaki gibi borç usulü yapılabilir veya çıkartılacak sayının 2'ye tümleyeni alınır, sayılar toplanır.

 01000011 (67)
\plus11101011 (-21)
=100101110 (46) (byte'ın en anlamlı biti 0 o.g sayı pozitif. En soldaki 1'i sallamıyoruz.)

 00010101 (21)
\plus01000011 (-67)
=11010010 (-46) (byte'ın en anlamlı biti 1 o.g sayı negatif. Sonucu bulmak için bir kere daha two's complement almalıyız.)

*** Octal ve Hexadecimal sayı düzeni

Octaldaki her basamak binaryde 3 bite, hexadecimaldeki her basamak binaryde 4 bite(1 nibble) karşılık geliyor.
1111b = Fh,  1010b = Ah
53FC8h = 0101 0011 1111 1100 1000b

** Registerlar

(16 bit - 2 byte - 1 word)

| AX | AH + AL | Accumulator Register | I/O işlemlerinde, aritmetik işlemlerde ve stringlerde kullanılır. Bazı komutlarda gizli operand durumundadır. Bazı durumlarda daha hızlı çalışır. |
| BX | BH + BL | Base Register        | Aritmetik işlemlerde ve dizilerde(index olarak) kullanılır. dizi[BX,SI,DI(sadece bunlar gelebilir)]                                               |
| CX | CH + CL | Count Register       | Döngülerde, shift işlemlerinde kullanılır.                                                                                                        |
| DX | DH + DL | Data Register        | I/O işlemlerinde, çarpma ve bölme işlemlerinde(çarpmada DX:AX, bölmede DX kalan AX bölüm) kullanılır.                                             |
| SP | -       | Stack Pointer        | Stackte işlem yapılacak alanı gösterir. Push ve pop ile değeri 2 artar veya azalır.                                                               |
| BP | -       | Base Pointer         | Stackte istediğimiz veriye ulaşmayı, okumayı ve kopyalamayı sağlar, stacki bozmaz.                                                                |
| IP | -       | Instruction Pointer  | İşlemcinin o anda çalıştıracağı komutun kod kesimi içindeki yerini belirtir.                                                                      |
| SI | -       | Source Index         | Göreli konumu göstermek için kullanılır.                                                                                                          |
| DI | -       | Destination Index    | SI gibi kullanılabiliyor, ayrıca ek kesim içindeki veriye erişmek için de kullanılır. Sanırım şöyle: SI = *p + 5 deki "*p" DI ise "+ 5"           |

