README.html

<div id="outline-container-org29e940b" class="outline-2">
<h2 id="org29e940b">Alt Seviye Programlama</h2>
<div class="outline-text-2" id="text-org29e940b">
</div>
<div id="outline-container-org5c5c798" class="outline-3">
<h3 id="org5c5c798">Ders Bilgisi</h3>
<div class="outline-text-3" id="text-org5c5c798">
</div>
<div id="outline-container-org10dbfff" class="outline-4">
<h4 id="org10dbfff">Dersin İçeriği</h4>
<div class="outline-text-4" id="text-org10dbfff">
<p>
Intel 80x86 Ailesi İşlemci Mimarisi; Yazmaçlar ve Görevleri; Bayraklar; Komutlar (Mnemonic);<br />
Adresleme Kipleri; Sözde (Pseudo) Komutlar; EXE ve COM Tipi Programlar;<br />
Yordam ve Yordam Çağırma, Makrolar, Kesim Birleştirme; Yordamlara Parametre Aktarımı;<br />
Kesmeler; Yüksek Seviyeli Diller ile Bağlantılar.<br />
</p>
</div>
</div>

<div id="outline-container-org6faf24b" class="outline-4">
<h4 id="org6faf24b">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</h4>
<div class="outline-text-4" id="text-org6faf24b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Hafta</th>
<th scope="col" class="org-left">Konular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-left">Alt seviye dilinin özellikleri, sayı ve kodlama sistemleri, 80x86 ailesi işlemcileri, yazmaçları ve bayrakları ile kesim organizasyonu</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-left">Komutlar (veri aktarımı, aritmetik ve dallanma)</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-left">Komutlar (çevrim, bayraklar, mantıksal, öteleme, döndürme)</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-left">Komutlar (katar işlemleri, ön ekler)</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-left">Adresleme modları, alt seviye programlama araçları, sözde komutlar</td>
</tr>

<tr>
<td class="org-center">6</td>
<td class="org-left">Çalışma ortamının hazırlanması ve debug kullanımı</td>
</tr>

<tr>
<td class="org-center">7</td>
<td class="org-left">EXE tipinde alt seviye programlama</td>
</tr>

<tr>
<td class="org-center">8</td>
<td class="org-left">COM tipinde alt seviye programlama</td>
</tr>

<tr>
<td class="org-center">9</td>
<td class="org-left">Ara Sınav 1</td>
</tr>

<tr>
<td class="org-center">10</td>
<td class="org-left">Yordam ve macro kullanımları</td>
</tr>

<tr>
<td class="org-center">11</td>
<td class="org-left">Alt-programlar ve parametre aktarma yöntemleri</td>
</tr>

<tr>
<td class="org-center">12</td>
<td class="org-left">Ortak kesim kullanımı ve EXTRN/PUBLIC tanımlamaları</td>
</tr>

<tr>
<td class="org-center">13</td>
<td class="org-left">Ara Sınav 2</td>
</tr>

<tr>
<td class="org-center">14</td>
<td class="org-left">Kesme, vectör tablosu ve alt seviye programlama dilinin yüksek seviyeli diller ile birlikte kullanılması</td>
</tr>

<tr>
<td class="org-center">15</td>
<td class="org-left">Final</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf19f500" class="outline-3">
<h3 id="orgf19f500">Sayı Sistemleri</h3>
<div class="outline-text-3" id="text-orgf19f500">
</div>
<div id="outline-container-org0179d6f" class="outline-4">
<h4 id="org0179d6f">İki sayı düzeninde çıkarma</h4>
<div class="outline-text-4" id="text-org0179d6f">
<p>
Onluk tabandaki gibi borç usulü yapılabilir veya çıkartılacak sayının 2'ye tümleyeni alınır, sayılar toplanır.<br />
</p>

<p>
 01000011 (67)<br />
+11101011 (-21)<br />
=100101110 (46) (byte'ın en anlamlı biti 0 o.g sayı pozitif. En soldaki 1'i sallamıyoruz.)<br />
</p>

<p>
 00010101 (21)<br />
+01000011 (-67)<br />
=11010010 (-46) (byte'ın en anlamlı biti 1 o.g sayı negatif. Sonucu bulmak için bir kere daha two's complement almalıyız.)<br />
</p>
</div>
</div>

<div id="outline-container-org1db6ec7" class="outline-4">
<h4 id="org1db6ec7">Octal ve Hexadecimal sayı düzeni</h4>
<div class="outline-text-4" id="text-org1db6ec7">
<p>
Octaldaki her basamak binaryde 3 bite, hexadecimaldeki her basamak binaryde 4 bite(1 nibble) karşılık geliyor.<br />
1111b = Fh,  1010b = Ah<br />
53FC8h = 0101 0011 1111 1100 1000b<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org5c0a70f" class="outline-3">
<h3 id="org5c0a70f">Registerlar</h3>
<div class="outline-text-3" id="text-org5c0a70f">
<p>
(16 bit - 2 byte - 1 word)<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">AX</td>
<td class="org-left">AH + AL</td>
<td class="org-left">Accumulator Register</td>
<td class="org-left">I/O işlemlerinde, aritmetik işlemlerde ve stringlerde kullanılır. Bazı komutlarda gizli operand durumundadır. Bazı durumlarda daha hızlı çalışır.</td>
</tr>

<tr>
<td class="org-left">BX</td>
<td class="org-left">BH + BL</td>
<td class="org-left">Base Register</td>
<td class="org-left">Aritmetik işlemlerde ve dizilerde(index olarak) kullanılır. dizi[BX,SI,DI(sadece bunlar gelebilir)]</td>
</tr>

<tr>
<td class="org-left">CX</td>
<td class="org-left">CH + CL</td>
<td class="org-left">Count Register</td>
<td class="org-left">Döngülerde, shift işlemlerinde kullanılır.</td>
</tr>

<tr>
<td class="org-left">DX</td>
<td class="org-left">DH + DL</td>
<td class="org-left">Data Register</td>
<td class="org-left">I/O işlemlerinde, çarpma ve bölme işlemlerinde(çarpmada DX:AX, bölmede DX kalan AX bölüm) kullanılır.</td>
</tr>

<tr>
<td class="org-left">SP</td>
<td class="org-left">-</td>
<td class="org-left">Stack Pointer</td>
<td class="org-left">Stackte işlem yapılacak alanı gösterir. Push ve pop ile değeri 2 artar veya azalır.</td>
</tr>

<tr>
<td class="org-left">BP</td>
<td class="org-left">-</td>
<td class="org-left">Base Pointer</td>
<td class="org-left">Stackte istediğimiz veriye ulaşmayı, okumayı ve kopyalamayı sağlar, stacki bozmaz.</td>
</tr>

<tr>
<td class="org-left">IP</td>
<td class="org-left">-</td>
<td class="org-left">Instruction Pointer</td>
<td class="org-left">İşlemcinin o anda çalıştıracağı komutun kod kesimi içindeki yerini belirtir.</td>
</tr>

<tr>
<td class="org-left">SI</td>
<td class="org-left">-</td>
<td class="org-left">Source Index</td>
<td class="org-left">Göreli konumu göstermek için kullanılır.</td>
</tr>

<tr>
<td class="org-left">DI</td>
<td class="org-left">-</td>
<td class="org-left">Destination Index</td>
<td class="org-left">SI gibi kullanılabiliyor, ayrıca ek kesim içindeki veriye erişmek için de kullanılır. Sanırım şöyle: SI = *p + 5 deki "*p" DI ise "+ 5"</td>
</tr>
</tbody>
</table>
</div>
</div>
