README.org
** Bayraklar(Flags)

Set = 1
Clear/Reset = 0

| CF | Carry Flag          | Elde/ödünç durumlarında 1 olur.                                                                                                                                                                                                  |
| PF | Parity Flag         | İşlem sonucunda 1lerin sayısı çift ise(buna even parity deniyor) 1 olur. Odd parity durumunda 0 olur.                                                                                                                            |
| ZF | Zero Flag           | İşlem sonucu 0 ise ZF 1 olur.                                                                                                                                                                                                    |
| SF | Sign Flag           | İşlem sonucunda sayının en anlamlı biti 1 ise SF 1 olur.                                                                                                                                                                         |
| TF | Trap Flag           | Adım bayrağı. TF = 1 ise her komuttan sonra bir kesme üretilir, böylece programı takip edebiliriz.                                                                                                                               |
| IF | Interrupt Flag      | Kesmeye izin verilip verilmeyeceğini belirtir.                                                                                                                                                                                   |
| DF | Direction Flag      | String işlemlerinde işlemin yüksek adresli bellekten düşük adresli belleğe doğru yürütülebilmesi için DF 1 olmalıdır. Aksi halde işlem düşükten adresten yükseğe ilerler.                                                        |
| OF | Overflow Flag       | Aritmetik taşma(işaretli sayılarla yapılan işlemlerde işaretli sonucun tanımlı alana sığmaması) olması halinde OF 1 olur.                                                                                                        |
| AF | Auxilary Carry Flag | 8'li işlemlerde düşük anlamlı 4'lüden yüksek anlamlı 4'lüye elde/ödünç, 16'lı işlemlerde düşük anlamlı 8'liden yüksek anlamlı 8'liye elde ödünç aktarılması durumunu kullanıcıya belirtmek üzere AF bayrağının değeri 1 yapılır. |
** Gerçek Kipte Fiziksel Adres Hesabı

Fiziksel Adres = 16x Kesim Yazmaç Değeri(CS - SS - DS, ES) + İşaret Yazmaç Değeri(IP - SP, BP - SI, DI, BX)(Göreli konum)

Örnek: CS <-- 2C58h ve IP <-- 0013h olursa CS:IP ikilisi hangi fiziksel adresi belirler?
2C58h x16 = 2C580h (16 ile çarpmak = 4 bit(hexadecimalde 1 basamak) sola shift)
2C580h + 0013h = 2C593h (Toplama sonucunda 20 bitlik değer elde edilir.)

** Komutlar
*** Veri Aktarım Komutları

| Komutlar                               | Kullanımı                                    | Ek bilgi                                                                                                                                                                                  |
|----------------------------------------+----------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| *MOV* /move data/                      | MOV destination, source                      | Bayraklarda değişiklik yapmaz                                                                                                                                                             |
| *LEA* /load effective address/         | LEA SI, sayiA                                | SI sayiA'nın adresini alır.                                                                                                                                                               |
| *LDS* /load data segment register/     | LDS SI, 1000H                                | İşlem sonucunda SI 1001H(high) ve 1000H(low) adreslerindeki değeri alır. İşlemin arka planında da DS bir sonraki adresteki değeri alır (yine high + low).                                 |
| *LES* /load extra segment register/    | LES DI, 1000H                                | Üsttekinin aynısı, SI yerine DI, DS yerine ES.                                                                                                                                            |
| *XCHG* /exchange/                      | XCHG AX, sayiB                               | İki değişken arası swap yapmaz. Bir tanesi illaki register olacak. =XCHG AX, BX=, =XCHG BX, AX='ten daha hızlı ve daha az yer kaplıyor.                                                   |

