README.html

<div id="outline-container-orgec9fe04" class="outline-3">
<h3 id="orgec9fe04">Bayraklar(Flags)</h3>
<div class="outline-text-3" id="text-orgec9fe04">
<p>
Set = 1<br />
Clear/Reset = 0<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">CF</td>
<td class="org-left">Carry Flag</td>
<td class="org-left">Elde/ödünç durumlarında 1 olur.</td>
</tr>

<tr>
<td class="org-left">PF</td>
<td class="org-left">Parity Flag</td>
<td class="org-left">İşlem sonucunda 1lerin sayısı çift ise(buna even parity deniyor) 1 olur. Odd parity durumunda 0 olur.</td>
</tr>

<tr>
<td class="org-left">ZF</td>
<td class="org-left">Zero Flag</td>
<td class="org-left">İşlem sonucu 0 ise ZF 1 olur.</td>
</tr>

<tr>
<td class="org-left">SF</td>
<td class="org-left">Sign Flag</td>
<td class="org-left">İşlem sonucunda sayının en anlamlı biti 1 ise SF 1 olur.</td>
</tr>

<tr>
<td class="org-left">TF</td>
<td class="org-left">Trap Flag</td>
<td class="org-left">Adım bayrağı. TF = 1 ise her komuttan sonra bir kesme üretilir, böylece programı takip edebiliriz.</td>
</tr>

<tr>
<td class="org-left">IF</td>
<td class="org-left">Interrupt Flag</td>
<td class="org-left">Kesmeye izin verilip verilmeyeceğini belirtir.</td>
</tr>

<tr>
<td class="org-left">DF</td>
<td class="org-left">Direction Flag</td>
<td class="org-left">String işlemlerinde işlemin yüksek adresli bellekten düşük adresli belleğe doğru yürütülebilmesi için DF 1 olmalıdır. Aksi halde işlem düşükten adresten yükseğe ilerler.</td>
</tr>

<tr>
<td class="org-left">OF</td>
<td class="org-left">Overflow Flag</td>
<td class="org-left">Aritmetik taşma(işaretli sayılarla yapılan işlemlerde işaretli sonucun tanımlı alana sığmaması) olması halinde OF 1 olur.</td>
</tr>

<tr>
<td class="org-left">AF</td>
<td class="org-left">Auxilary Carry Flag</td>
<td class="org-left">8'li işlemlerde düşük anlamlı 4'lüden yüksek anlamlı 4'lüye elde/ödünç, 16'lı işlemlerde düşük anlamlı 8'liden yüksek anlamlı 8'liye elde ödünç aktarılması durumunu kullanıcıya belirtmek üzere AF bayrağının değeri 1 yapılır.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9d2f433" class="outline-3">
<h3 id="org9d2f433">Gerçek Kipte Fiziksel Adres Hesabı</h3>
<div class="outline-text-3" id="text-org9d2f433">
<p>
Fiziksel Adres = 16x Kesim Yazmaç Değeri(CS - SS - DS, ES) + İşaret Yazmaç Değeri(IP - SP, BP - SI, DI, BX)(Göreli konum)<br />
</p>

<p>
Örnek: CS &lt;&#x2013; 2C58h ve IP &lt;&#x2013; 0013h olursa CS:IP ikilisi hangi fiziksel adresi belirler?<br />
2C58h x16 = 2C580h (16 ile çarpmak = 4 bit(hexadecimalde 1 basamak) sola shift)<br />
2C580h + 0013h = 2C593h (Toplama sonucunda 20 bitlik değer elde edilir.)<br />
</p>
</div>
</div>

<div id="outline-container-org0bc5442" class="outline-3">
<h3 id="org0bc5442">Komutlar</h3>
<div class="outline-text-3" id="text-org0bc5442">
</div>
<div id="outline-container-orgc53a02c" class="outline-4">
<h4 id="orgc53a02c">Veri Aktarım Komutları</h4>
<div class="outline-text-4" id="text-orgc53a02c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Komutlar</th>
<th scope="col" class="org-left">Kullanımı</th>
<th scope="col" class="org-left">Ek bilgi</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>MOV</b> <i>move data</i></td>
<td class="org-left">MOV destination, source</td>
<td class="org-left">Bayraklarda değişiklik yapmaz</td>
</tr>

<tr>
<td class="org-left"><b>LEA</b> <i>load effective address</i></td>
<td class="org-left">LEA SI, sayiA</td>
<td class="org-left">SI sayiA'nın adresini alır.</td>
</tr>

<tr>
<td class="org-left"><b>LDS</b> <i>load data segment register</i></td>
<td class="org-left">LDS SI, 1000H</td>
<td class="org-left">İşlem sonucunda SI 1001H(high) ve 1000H(low) adreslerindeki değeri alır. İşlemin arka planında da DS bir sonraki adresteki değeri alır (yine high + low).</td>
</tr>

<tr>
<td class="org-left"><b>LES</b> <i>load extra segment register</i></td>
<td class="org-left">LES DI, 1000H</td>
<td class="org-left">Üsttekinin aynısı, SI yerine DI, DS yerine ES.</td>
</tr>

<tr>
<td class="org-left"><b>XCHG</b> <i>exchange</i></td>
<td class="org-left">XCHG AX, sayiB</td>
<td class="org-left">İki değişken arası swap yapmaz. Bir tanesi illaki register olacak. <code>XCHG AX, BX</code>, <code>XCHG BX, AX</code>'ten daha hızlı ve daha az yer kaplıyor.</td>
</tr>
</tbody>
</table>
</div>
</div>
