README.org
*** Aritmetik Komutlar

| Komutlar                               | Kullanımı                                    | Ek bilgi                                                                                                                                                                                                                                                                                                                                                                                            |
|----------------------------------------+----------------------------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| *ADD* /addition/                       | ADD sayi, 5                                  | --> sayi = sayi + 5. MOV AL,255; ADD AL,5 işlemleri sonrası carry flag 1 olur.                                                                                                                                                                                                                                                                                                                      |
| *ADC* /add with carry/                 | MOV AH, 0; MOV AL, 255; ADD AL, 5; ADC AH, 0 | --> AH = 0, AL = 255, AL += 5 (CF = 1 oldu), ADC AH,0 (AH = CF = 1 oldu) --> *AX = 0104H* (işlem sonunda CF tekrar 0 olur)                                                                                                                                                                                                                                                                          |
| *SUB* /subtraction/                    | SUB sayi, 5                                  | sayi = sayi - 5                                                                                                                                                                                                                                                                                                                                                                                     |
| *SBB* /subtraction with borrow/        | SBB sayi, 5                                  | sayi = sayi - 5 - CF                                                                                                                                                                                                                                                                                                                                                                                |
| *INC* /increment/                      | INC AX                                       | AX++. =INC AX; INC AX=, =ADD AX, 2='den daha az yer kaplıyor.                                                                                                                                                                                                                                                                                                                                       |
| *DEC* /decrement/                      | DEC sayi                                     | sayi- -.                                                                                                                                                                                                                                                                                                                                                                                            |
| *NEG* /negate / two's complement/      | NEG BX                                       | BX'in 2'ye tümleyenini alır. (C'de: =sayi = ~sayi + 1=)                                                                                                                                                                                                                                                                                                                                             |
| *MUL* /unsigned multiplication/        | MUL CL; 8 bit                                | AX \leftarrow AL * CL                                                                                                                                                                                                                                                                                                                                                                               |
|                                        | MUL BX; 16 bit                               | DX:AX \leftarrow AX * BX                                                                                                                                                                                                                                                                                                                                                                            |
| *IMUL* /integer signed multiplication/ | IMUL CL, sayi                                | MUL gibi tek operandlı veya opr1 \leftarrow opr2 * opr3 olacak şekilde üç operandlı da kullalılabiliyor.                                                                                                                                                                                                                                                                                            |
| *DIV* /unsigned divide/                | DIV BH                                       | AX / BH işlemi yapılır. AL \leftarrow bölüm, AH \leftarrow kalan olur.                                                                                                                                                                                                                                                                                                                              |
|                                        | DIV sayiWord                                 | DX:AX şeklinde tutulan 32 bit sayı /sayiWord/'e bölünür. AX \leftarrow bölüm, DX \leftarrow kalan olur.                                                                                                                                                                                                                                                                                             |
| *IDIV* /integer signed division/       | IDIV CH                                      | DIV'in işaretli olanı.                                                                                                                                                                                                                                                                                                                                                                              |
| *CMP* /compare/                        | CMP AX, BX                                   | AX - BX işlemi yapılır. Operandların değerini etkilemez. [[CMP][Karşılaştırmanın sonucu bayraklardaki değerlere göre belirlenir]]. CMP komutundan hemen sonra bir dallanma komutu kullanılmalıdır. Çok nadir durumlarda CMP ile dallanma komutu arasına başka komutlar girebilir fakat bu komutların bayrakların değerini değiştirmeyen türden (örneğin veri aktarım komutları) olmasına dikkat edilmelidir. |



<<CMP>>CMP kontrol tablosu:

| Condition | Signed Comparison       | Unsigned Comparison  |
|-----------+-------------------------+----------------------|
| a > b     | ZF = 0 \wedge SF = OF   | CF = 0 \wedge ZF = 0 |
| a \ge b   | SF = OF                 | CF = 0               |
| a = b     | ZF = 1                  | ZF = 1               |
| a \le b   | ZF = 1 \wedge SF \ne OF | CF = 1 \vee ZF = 1   |
| a < b     | SF \ne OF               | CF = 1               |

*** Dallanma Komutları

IP yazmacının değeri bu komutların çalışması ile değişir.

**** Koşullu Dallanma Komutları

Koşullu dallanma komutlarında atlama aralığı 8 bit ile sınırlıdır. 128 byte geri veya 127 byte ileri gidebilir.

