README.html

<div id="outline-container-orge75d4cd" class="outline-4">
<h4 id="orge75d4cd">Aritmetik Komutlar</h4>
<div class="outline-text-4" id="text-orge75d4cd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Komutlar</th>
<th scope="col" class="org-left">Kullanımı</th>
<th scope="col" class="org-left">Ek bilgi</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>ADD</b> <i>addition</i></td>
<td class="org-left">ADD sayi, 5</td>
<td class="org-left">&#x2013;&gt; sayi = sayi + 5. MOV AL,255; ADD AL,5 işlemleri sonrası carry flag 1 olur.</td>
</tr>

<tr>
<td class="org-left"><b>ADC</b> <i>add with carry</i></td>
<td class="org-left">MOV AH, 0; MOV AL, 255; ADD AL, 5; ADC AH, 0</td>
<td class="org-left">&#x2013;&gt; AH = 0, AL = 255, AL += 5 (CF = 1 oldu), ADC AH,0 (AH = CF = 1 oldu) &#x2013;&gt; <b>AX = 0104H</b> (işlem sonunda CF tekrar 0 olur)</td>
</tr>

<tr>
<td class="org-left"><b>SUB</b> <i>subtraction</i></td>
<td class="org-left">SUB sayi, 5</td>
<td class="org-left">sayi = sayi - 5</td>
</tr>

<tr>
<td class="org-left"><b>SBB</b> <i>subtraction with borrow</i></td>
<td class="org-left">SBB sayi, 5</td>
<td class="org-left">sayi = sayi - 5 - CF</td>
</tr>

<tr>
<td class="org-left"><b>INC</b> <i>increment</i></td>
<td class="org-left">INC AX</td>
<td class="org-left">AX++. <code>INC AX; INC AX</code>, <code>ADD AX, 2</code>'den daha az yer kaplıyor.</td>
</tr>

<tr>
<td class="org-left"><b>DEC</b> <i>decrement</i></td>
<td class="org-left">DEC sayi</td>
<td class="org-left">sayi- -.</td>
</tr>

<tr>
<td class="org-left"><b>NEG</b> <i>negate / two's complement</i></td>
<td class="org-left">NEG BX</td>
<td class="org-left">BX'in 2'ye tümleyenini alır. (C'de: <code>sayi = ~sayi + 1</code>)</td>
</tr>

<tr>
<td class="org-left"><b>MUL</b> <i>unsigned multiplication</i></td>
<td class="org-left">MUL CL; 8 bit</td>
<td class="org-left">AX &larr; AL * CL</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">MUL BX; 16 bit</td>
<td class="org-left">DX:AX &larr; AX * BX</td>
</tr>

<tr>
<td class="org-left"><b>IMUL</b> <i>integer signed multiplication</i></td>
<td class="org-left">IMUL CL, sayi</td>
<td class="org-left">MUL gibi tek operandlı veya opr1 &larr; opr2 * opr3 olacak şekilde üç operandlı da kullalılabiliyor.</td>
</tr>

<tr>
<td class="org-left"><b>DIV</b> <i>unsigned divide</i></td>
<td class="org-left">DIV BH</td>
<td class="org-left">AX / BH işlemi yapılır. AL &larr; bölüm, AH &larr; kalan olur.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">DIV sayiWord</td>
<td class="org-left">DX:AX şeklinde tutulan 32 bit sayı <i>sayiWord</i>'e bölünür. AX &larr; bölüm, DX &larr; kalan olur.</td>
</tr>

<tr>
<td class="org-left"><b>IDIV</b> <i>integer signed division</i></td>
<td class="org-left">IDIV CH</td>
<td class="org-left">DIV'in işaretli olanı.</td>
</tr>

<tr>
<td class="org-left"><b>CMP</b> <i>compare</i></td>
<td class="org-left">CMP AX, BX</td>
<td class="org-left">AX - BX işlemi yapılır. Operandların değerini etkilemez. <a href="#org28f9c48">Karşılaştırmanın sonucu bayraklardaki değerlere göre belirlenir</a>. CMP komutundan hemen sonra bir dallanma komutu kullanılmalıdır. Çok nadir durumlarda CMP ile dallanma komutu arasına başka komutlar girebilir fakat bu komutların bayrakların değerini değiştirmeyen türden (örneğin veri aktarım komutları) olmasına dikkat edilmelidir.</td>
</tr>
</tbody>
</table>



<p>
<a id="org28f9c48"></a>CMP kontrol tablosu:<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Condition</th>
<th scope="col" class="org-left">Signed Comparison</th>
<th scope="col" class="org-left">Unsigned Comparison</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">a &gt; b</td>
<td class="org-left">ZF = 0 &and; SF = OF</td>
<td class="org-left">CF = 0 &and; ZF = 0</td>
</tr>

<tr>
<td class="org-left">a &ge; b</td>
<td class="org-left">SF = OF</td>
<td class="org-left">CF = 0</td>
</tr>

<tr>
<td class="org-left">a = b</td>
<td class="org-left">ZF = 1</td>
<td class="org-left">ZF = 1</td>
</tr>

<tr>
<td class="org-left">a &le; b</td>
<td class="org-left">ZF = 1 &and; SF &ne; OF</td>
<td class="org-left">CF = 1 &or; ZF = 1</td>
</tr>

<tr>
<td class="org-left">a &lt; b</td>
<td class="org-left">SF &ne; OF</td>
<td class="org-left">CF = 1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org45c206b" class="outline-4">
<h4 id="org45c206b">Dallanma Komutları</h4>
<div class="outline-text-4" id="text-org45c206b">
<p>
IP yazmacının değeri bu komutların çalışması ile değişir.<br />
</p>
</div>

<ul class="org-ul">
<li><a id="org4615363"></a>Koşullu Dallanma Komutları<br />
<div class="outline-text-5" id="text-org4615363">
<p>
Koşullu dallanma komutlarında atlama aralığı 8 bit ile sınırlıdır. 128 byte geri veya 127 byte ileri gidebilir.<br />
</p>
</div>

<ul class="org-ul">
