README.org
***** Basit Koşullu Dallanma Komutları

| Komut                                            | Koşul                                                                      | Flag karşılığı |
|--------------------------------------------------+----------------------------------------------------------------------------+----------------|
| *JZ* / *JE* /jump zero / jump equal/             | CMP işleminin sonucunda eşitlik çıkması                                    | ZF = 1         |
| *JNZ* / *JNE* /jump not zero / jump not equal/   | CMP işleminin sonucunda eşitlik çıkmaması                                  | ZF = 0         |
| *JS* /jump if sign/                              | CMP işleminin sonucunda elde edilen değer negatif ise                      | SF = 1         |
| *JNS* /jump no sign/                             | CMP işleminin sonucunda elde edilen değer pozitif ise                      | SF = 0         |
| *JO* /jump if overflow/                          | CMP işleminin sonucunda aritmetik bir taşma var ise                        | OF = 1         |
| *JNO* /jump no overflow/                         | Taşma yoksa                                                                | OF = 0         |
| *JP* / *JPE* /jump on parity / jump parity even/ | CMP işleminin sonucunda even parity(1 sayısının çift sayıda olması) olması | PF = 1         |
| *JNP* / *JPO* /jump no parity / jump parity odd/ | Odd parity oluşması                                                        | PF = 0         |

***** İşaretsiz Sayı İşlemlerine Ait Koşullu Dallanma Komutları

| Komut                                                                      | Koşul                                     | Flag karşılığı       |
|----------------------------------------------------------------------------+-------------------------------------------+----------------------|
| *JB* / *JNAE* / *JC* /jump below / jump not above equal / jump carry/      | opr1 opr2'nin altında ise (= opr1 < opr2) | CF = 1               |
| *JA* / *JNBE* /jump above / jump not below equal/                          | opr1 opr2'nin üstünde ise (= opr1 > opr2) | CF = 0 \wedge ZF = 0 |
| *JAE* / *JNB* / *JNC* /jump above equal / jump not below / jump not carry/ | opr1 \ge opr2                             | CF = 0               |
| *JBE* / *JNA* /jump below equal / jump not above/                          | opr1 \le opr2                             | CF = 1 \vee ZF = 1   |

***** İşaretli Sayı İşlemlerine Ait Koşullu Dallanma Komutları

| Komut                                                  | Koşul         | Flag karşılığı                 |
|--------------------------------------------------------+---------------+--------------------------------|
| *JL* / *JNGE* /jump less / jump not greater and equal/ | opr1 < opr2   | SF \oplus OF = 1 \wedge ZF = 0 |
| *JNL* / *JGE* /jump not less / jump greater and equal/ | opr1 \ge opr2 | SF \oplus OF = 0               |
| *JLE* / *JNG* /jump less equal / jump not greater/     | opr1 \le opr2 | SF \oplus OF = 1 \wedge ZF = 1 |
| *JG* / *JNLE* /jump greater / jump not less equal/     | opr1 > opr2   | SF \oplus OF = 0 \wedge ZF = 0 |

**** Koşulsuz Dallanma Komutları

| Komut                    | Kullanım Şekli                | Ek Bilgi                |
|--------------------------+-------------------------------+-------------------------|
| *JMP* /near jump/        | JMP /label/                   | Kesim içi dallanma      |
| *JMP FAR PTR* /far jump/ | JMP FAR PTR /label/ / /adres/ | Kesimler arası dallanma |

*** Öteleme ve Döndürme Komutları

Eklenecek.

*** Mantıksal Komutlar

Eklenecek.

*** Stack Komutları

Eklenecek.

** Bazı kod bloklarının assemblydeki eşdeğerleri
*** If bloğu

C dilinde:
#+BEGIN_SRC C
  if (AX == 0) {
      BX = 2;
  }
  else{
      BX = 1;
  }
  CX = 5;
#+END_SRC

Assembly dilinde:
#+BEGIN_SRC asm
		  CMP AX,0
		  JZ thenblock
		  MOV BX,1	
		  JMP nextblock	
  thenblock:	MOV BX,2
  nextblock:	MOV CX,5
#+END_SRC
*** For bloğu

C dilinde:
#+BEGIN_SRC C
  AX = 0;
  for (i = 1; i <= 10; ++i) {
      AX += i;
  }
#+END_SRC

Assembly dilinde:
#+BEGIN_SRC asm
	  XOR AX, AX
          MOV CX, 10 //LOOP komutu otomatik olarak //
L1:	  ADD AX, CX //CX'in değerini 1 azaltır    //
	  LOOP L1
#+END_SRC

İkişer azaltma örneği:
#+BEGIN_SRC asm
	  XOR AX, AX
	  MOV CX, 10   // LOOP yerine CMP ve JMP
L1:	  ADD AX, CX   // kullanarak veya
	  DEC CX       // CX ve JCXZ kullanarak 
	  LOOP L1      // da yapılabilir.
#+END_SRC

*** While bloğu

C dilinde:
#+BEGIN_SRC C
  AX = 0;
  i = 1;

  while (i <= 10 ) {
      AX += i;
      i += 2;
  }
#+END_SRC

Assembly dilinde:
#+BEGIN_SRC asm
	  XOR AX, AX
	  MOV SI, 1
  L1:	CMP SI, 10     ////////////////////////////////////////////
	  JA next      // do while bloğu için once işlem         //
	  ADD AX, SI   // en son(next'ten once) CMP yapılabilir. //
	  ADD SI, 2    ////////////////////////////////////////////
	  JMP L1
  next:	
#+END_SRC

*** İç içe for

Bubble sort üzerinden örnek:

C dilinde:
#+BEGIN_SRC C
  for (i = 0; i <= 3; ++i) {
      for (j = i + 1; j <= 4; ++j) {
	  if (dizi[i] < dizi[j]) {
	      swap(&dizi[i], &dizi[j]);
	  }
      }
  }
#+END_SRC

Assembly dilinde:
#+BEGIN_SRC asm
	  MOV CX, 4
	  MOV SI, 0
  L2:	PUSH CX      // dıştaki for'un CX'ini stacke atıyoruz
	  MOV DI, SI   // push komutu registerın orjinal değerini değiştirmez.
  L1:	INC DI
	  MOV AX, dizi[SI]
	  CMP AX, dizi[DI]
	  JGE NEXT
	  XCHG AX, dizi[DI]
	  MOV dizi[SI], AX
  next:	LOOP L1
	  POP CX   // CX = Stack'teki en üstte bulunan değer (yani 3.
	  INC SI   // satırda attığımız CX değeri)
	  LOOP L2
#+END_SRC

*** 
* Ayrık Matematik
** Ders Bilgisi
*** Dersin İçeriği

Mantık;Kümeler ve Foksiyonlar; Algoritmanın Temelleri; Sayılar ve Matrisler; Hesaplama Teknikleri;
Kromatik Polinomlar; Graflar; Ağaçlar; Boole Cebri; Çıkışlı ve Çıkışsız Solu Durum Makineleri

