README.html
<li><a id="orgc7e471a"></a>Basit Koşullu Dallanma Komutları<br />
<div class="outline-text-6" id="text-orgc7e471a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Komut</th>
<th scope="col" class="org-left">Koşul</th>
<th scope="col" class="org-left">Flag karşılığı</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>JZ</b> / <b>JE</b> <i>jump zero / jump equal</i></td>
<td class="org-left">CMP işleminin sonucunda eşitlik çıkması</td>
<td class="org-left">ZF = 1</td>
</tr>

<tr>
<td class="org-left"><b>JNZ</b> / <b>JNE</b> <i>jump not zero / jump not equal</i></td>
<td class="org-left">CMP işleminin sonucunda eşitlik çıkmaması</td>
<td class="org-left">ZF = 0</td>
</tr>

<tr>
<td class="org-left"><b>JS</b> <i>jump if sign</i></td>
<td class="org-left">CMP işleminin sonucunda elde edilen değer negatif ise</td>
<td class="org-left">SF = 1</td>
</tr>

<tr>
<td class="org-left"><b>JNS</b> <i>jump no sign</i></td>
<td class="org-left">CMP işleminin sonucunda elde edilen değer pozitif ise</td>
<td class="org-left">SF = 0</td>
</tr>

<tr>
<td class="org-left"><b>JO</b> <i>jump if overflow</i></td>
<td class="org-left">CMP işleminin sonucunda aritmetik bir taşma var ise</td>
<td class="org-left">OF = 1</td>
</tr>

<tr>
<td class="org-left"><b>JNO</b> <i>jump no overflow</i></td>
<td class="org-left">Taşma yoksa</td>
<td class="org-left">OF = 0</td>
</tr>

<tr>
<td class="org-left"><b>JP</b> / <b>JPE</b> <i>jump on parity / jump parity even</i></td>
<td class="org-left">CMP işleminin sonucunda even parity(1 sayısının çift sayıda olması) olması</td>
<td class="org-left">PF = 1</td>
</tr>

<tr>
<td class="org-left"><b>JNP</b> / <b>JPO</b> <i>jump no parity / jump parity odd</i></td>
<td class="org-left">Odd parity oluşması</td>
<td class="org-left">PF = 0</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org7a2cc64"></a>İşaretsiz Sayı İşlemlerine Ait Koşullu Dallanma Komutları<br />
<div class="outline-text-6" id="text-org7a2cc64">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Komut</th>
<th scope="col" class="org-left">Koşul</th>
<th scope="col" class="org-left">Flag karşılığı</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>JB</b> / <b>JNAE</b> / <b>JC</b> <i>jump below / jump not above equal / jump carry</i></td>
<td class="org-left">opr1 opr2'nin altında ise (= opr1 &lt; opr2)</td>
<td class="org-left">CF = 1</td>
</tr>

<tr>
<td class="org-left"><b>JA</b> / <b>JNBE</b> <i>jump above / jump not below equal</i></td>
<td class="org-left">opr1 opr2'nin üstünde ise (= opr1 &gt; opr2)</td>
<td class="org-left">CF = 0 &and; ZF = 0</td>
</tr>

<tr>
<td class="org-left"><b>JAE</b> / <b>JNB</b> / <b>JNC</b> <i>jump above equal / jump not below / jump not carry</i></td>
<td class="org-left">opr1 &ge; opr2</td>
<td class="org-left">CF = 0</td>
</tr>

<tr>
<td class="org-left"><b>JBE</b> / <b>JNA</b> <i>jump below equal / jump not above</i></td>
<td class="org-left">opr1 &le; opr2</td>
<td class="org-left">CF = 1 &or; ZF = 1</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org0d8326f"></a>İşaretli Sayı İşlemlerine Ait Koşullu Dallanma Komutları<br />
<div class="outline-text-6" id="text-org0d8326f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Komut</th>
<th scope="col" class="org-left">Koşul</th>
<th scope="col" class="org-left">Flag karşılığı</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>JL</b> / <b>JNGE</b> <i>jump less / jump not greater and equal</i></td>
<td class="org-left">opr1 &lt; opr2</td>
<td class="org-left">SF &oplus; OF = 1 &and; ZF = 0</td>
</tr>

<tr>
<td class="org-left"><b>JNL</b> / <b>JGE</b> <i>jump not less / jump greater and equal</i></td>
<td class="org-left">opr1 &ge; opr2</td>
<td class="org-left">SF &oplus; OF = 0</td>
</tr>

<tr>
<td class="org-left"><b>JLE</b> / <b>JNG</b> <i>jump less equal / jump not greater</i></td>
<td class="org-left">opr1 &le; opr2</td>
<td class="org-left">SF &oplus; OF = 1 &and; ZF = 1</td>
</tr>

<tr>
<td class="org-left"><b>JG</b> / <b>JNLE</b> <i>jump greater / jump not less equal</i></td>
<td class="org-left">opr1 &gt; opr2</td>
<td class="org-left">SF &oplus; OF = 0 &and; ZF = 0</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</li>

<li><a id="org04f53e8"></a>Koşulsuz Dallanma Komutları<br />
<div class="outline-text-5" id="text-org04f53e8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Komut</th>
<th scope="col" class="org-left">Kullanım Şekli</th>
<th scope="col" class="org-left">Ek Bilgi</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>JMP</b> <i>near jump</i></td>
<td class="org-left">JMP <i>label</i></td>
<td class="org-left">Kesim içi dallanma</td>
</tr>

<tr>
<td class="org-left"><b>JMP FAR PTR</b> <i>far jump</i></td>
<td class="org-left">JMP FAR PTR <i>label</i> / <i>adres</i></td>
<td class="org-left">Kesimler arası dallanma</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</div>

<div id="outline-container-org88dd652" class="outline-4">
<h4 id="org88dd652">Öteleme ve Döndürme Komutları</h4>
<div class="outline-text-4" id="text-org88dd652">
<p>
Eklenecek.<br />
</p>
</div>
</div>

<div id="outline-container-org3a422a2" class="outline-4">
<h4 id="org3a422a2">Mantıksal Komutlar</h4>
<div class="outline-text-4" id="text-org3a422a2">
<p>
Eklenecek.<br />
</p>
</div>
</div>

<div id="outline-container-orga3e92cc" class="outline-4">
<h4 id="orga3e92cc">Stack Komutları</h4>
<div class="outline-text-4" id="text-orga3e92cc">
<p>
Eklenecek.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org581cbe5" class="outline-3">
<h3 id="org581cbe5">Bazı kod bloklarının assemblydeki eşdeğerleri</h3>
<div class="outline-text-3" id="text-org581cbe5">
</div>
<div id="outline-container-orgf0392d2" class="outline-4">
<h4 id="orgf0392d2">If bloğu</h4>
<div class="outline-text-4" id="text-orgf0392d2">
<p>
C dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-C">if (AX == 0) {
    BX = 2;
}
else{
    BX = 1;
}
CX = 5;
</pre>
</div>

<p>
Assembly dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-asm">    CMP AX,0
    JZ thenblock
    MOV BX,1	
    JMP nextblock	
thenblock:	MOV BX,2
nextblock:	MOV CX,5
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf395cc" class="outline-4">
<h4 id="orgcf395cc">For bloğu</h4>
<div class="outline-text-4" id="text-orgcf395cc">
<p>
C dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-C">AX = 0;
for (i = 1; i &lt;= 10; ++i) {
    AX += i;
}
</pre>
</div>

<p>
Assembly dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-asm">    XOR AX, AX
          MOV CX, 10 //LOOP komutu otomatik olarak //
L1:	  ADD AX, CX //CX'in değerini 1 azaltır    //
    LOOP L1
</pre>
</div>

<p>
İkişer azaltma örneği:<br />
</p>
<div class="org-src-container">
<pre class="src src-asm">    XOR AX, AX
    MOV CX, 10   // LOOP yerine CMP ve JMP
L1:	  ADD AX, CX   // kullanarak veya
    DEC CX       // CX ve JCXZ kullanarak 
    LOOP L1      // da yapılabilir.
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ae7569" class="outline-4">
<h4 id="org0ae7569">While bloğu</h4>
<div class="outline-text-4" id="text-org0ae7569">
<p>
C dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-C">AX = 0;
i = 1;

while (i &lt;= 10 ) {
    AX += i;
    i += 2;
}
</pre>
</div>

<p>
Assembly dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-asm">  XOR AX, AX
  MOV SI, 1
L1:	CMP SI, 10     ////////////////////////////////////////////
  JA next      // do while bloğu için once işlem         //
  ADD AX, SI   // en son(next'ten once) CMP yapılabilir. //
  ADD SI, 2    ////////////////////////////////////////////
  JMP L1
next:	
</pre>
</div>
</div>
</div>

<div id="outline-container-org14aa0c1" class="outline-4">
<h4 id="org14aa0c1">İç içe for</h4>
<div class="outline-text-4" id="text-org14aa0c1">
<p>
Bubble sort üzerinden örnek:<br />
</p>

<p>
C dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-C">for (i = 0; i &lt;= 3; ++i) {
    for (j = i + 1; j &lt;= 4; ++j) {
  if (dizi[i] &lt; dizi[j]) {
      swap(&amp;dizi[i], &amp;dizi[j]);
  }
    }
}
</pre>
</div>

<p>
Assembly dilinde:<br />
</p>
<div class="org-src-container">
<pre class="src src-asm">  MOV CX, 4
  MOV SI, 0
L2:	PUSH CX      // dıştaki for'un CX'ini stacke atıyoruz
  MOV DI, SI   // push komutu registerın orjinal değerini değiştirmez.
L1:	INC DI
  MOV AX, dizi[SI]
  CMP AX, dizi[DI]
  JGE NEXT
  XCHG AX, dizi[DI]
  MOV dizi[SI], AX
next:	LOOP L1
  POP CX   // CX = Stack'teki en üstte bulunan değer (yani 3.
  INC SI   // satırda attığımız CX değeri)
  LOOP L2
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cab572" class="outline-4">
<h4 id="org5cab572"></h4>
</div>
</div>
</div>
<div id="outline-container-orge0fb8e8" class="outline-2">
<h2 id="orge0fb8e8">Ayrık Matematik</h2>
<div class="outline-text-2" id="text-orge0fb8e8">
</div>
