README.org
*** Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları

| Hafta | Konular                                     |
|-------+---------------------------------------------|
| <c>   | <l>                                         |
| 1     | Matematiğin Dili                            |
| 2     | Mantık, Kümeler ve Fonksiyonlar-I           |
| 3     | Mantık, Kümeler ve Fonksiyonlar-II          |
| 4     | Algoritmalar ve Algoritmaların Karmaşıklığı |
| 5     | Hesaplama Teknikleri                        |
| 6     | Bağıntılar                                  |
| 7     | Kromatik Polinomlar                         |
| 8     | Ağaçlar ve Uygulamaları-I                   |
| 9     | Ara Sınav 1                                 |
| 10    | Ağaçlar ve Uygulamaları-II                  |
| 11    | Graf Teori-I                                |
| 12    | Graf Teori-II                               |
| 13    | Ara Sınav 2                                 |
| 14    | Çıkışlı ve Çıkışsız Sonlu Durum Makineleri  |
| 15    | Final                                       |

* Lojik Devreler
** Ders Bilgisi
*** Dersin İçeriği

Sayı Sistemleri; Boole Cebri; Lojik Fonksiyonların İndirgenmesi; Karnaugh Haritaları;
Quine-McClusky Yöntemi; Kombinezonal Devre Analizi; Kombinezonal Devre Tasarımı;
Senkron ve Asenkron Devre Yapıları; Ardışıl Devre Analizi; Ardışıl Devre Tasarımı;
Saklayıcılar, Sayıcılar, Bellekler.

*** Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları

| Hafta | Konular                                                                             |
|-------+-------------------------------------------------------------------------------------|
| <c>   | <l>                                                                                 |
| 1     | Sayısal sistemlerin genel özellikleri                                               |
| 2     | Boole cebrinin temelleri                                                            |
| 3     | Lojik fonksiyonlar, kanonik ve standart biçimler                                    |
| 4     | Lojik kapılar, lojik fonksiyonlarin sadeleştirilmesi                                |
| 5     | Karnaugh haritaları/diyagramları, Quine –McCluskey yöntemi                          |
| 6     | Kombinezonsal devreler, aritmetik toplama çıkarma devreleri, seçiciler, dağıtıcılar |
| 7     | Kod çözücüler, kodlayıcılar, ALU tasarımı, 7–parçalı gösterge                       |
| 8     | Ardışıl devre temelleri                                                             |
| 9     | Ara Sınav 1                                                                         |
| 10    | Ardışıl devrelerin durum tablosu, durum diyagramı ve sonlu durum makineleri         |
| 11    | Flip-Flop’lar: D, T, SR, JK,flip-flopları, tutucular                                |
| 12    | Ardışıl devrelerin çözümlenmesi                                                     |
| 13    | Ardışıl devrelerin tasarımı                                                         |
| 14    | Saklayıcılar, sayıcılar, bellekler, programlanabilir ardışıl devreler               |
| 15    | Final                                                                               |

* Sinyaller ve Sistemler
** Ders Bilgisi
*** Dersin İçeriği

Temel konseptlere giriş; Sinyaller ve Sistemler; Doğrusal ve Zamanla Değişmeyen Sistemler;
Sürekli Zamanlı Sistemlerin Zaman Bölgesi Analizleri; Ayrık Zamanlı Sistemlerin Zaman Bölgesi Analizleri;
Sürekli Zamanlı Fourier Serisi; Ayrık Fourier Dönüşümü; Sürekli Zamanlı Fourier Dönüşümü;
Bazı Fonksiyonların Fourier Dönüşümleri; Örnekleme ve Yeniden-kurma; Laplace Dönüşümü; z-Dönüşümü.

