README.html
<div id="outline-container-orgb4db1e8" class="outline-3">
<h3 id="orgb4db1e8">Ders Bilgisi</h3>
<div class="outline-text-3" id="text-orgb4db1e8">
</div>
<div id="outline-container-orga6e93cf" class="outline-4">
<h4 id="orga6e93cf">Dersin İçeriği</h4>
<div class="outline-text-4" id="text-orga6e93cf">
<p>
Mantık;Kümeler ve Foksiyonlar; Algoritmanın Temelleri; Sayılar ve Matrisler; Hesaplama Teknikleri;<br />
Kromatik Polinomlar; Graflar; Ağaçlar; Boole Cebri; Çıkışlı ve Çıkışsız Solu Durum Makineleri<br />
</p>
</div>
</div>

<div id="outline-container-orgd9e65b3" class="outline-4">
<h4 id="orgd9e65b3">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</h4>
<div class="outline-text-4" id="text-orgd9e65b3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Hafta</th>
<th scope="col" class="org-left">Konular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-left">Matematiğin Dili</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-left">Mantık, Kümeler ve Fonksiyonlar-I</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-left">Mantık, Kümeler ve Fonksiyonlar-II</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-left">Algoritmalar ve Algoritmaların Karmaşıklığı</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-left">Hesaplama Teknikleri</td>
</tr>

<tr>
<td class="org-center">6</td>
<td class="org-left">Bağıntılar</td>
</tr>

<tr>
<td class="org-center">7</td>
<td class="org-left">Kromatik Polinomlar</td>
</tr>

<tr>
<td class="org-center">8</td>
<td class="org-left">Ağaçlar ve Uygulamaları-I</td>
</tr>

<tr>
<td class="org-center">9</td>
<td class="org-left">Ara Sınav 1</td>
</tr>

<tr>
<td class="org-center">10</td>
<td class="org-left">Ağaçlar ve Uygulamaları-II</td>
</tr>

<tr>
<td class="org-center">11</td>
<td class="org-left">Graf Teori-I</td>
</tr>

<tr>
<td class="org-center">12</td>
<td class="org-left">Graf Teori-II</td>
</tr>

<tr>
<td class="org-center">13</td>
<td class="org-left">Ara Sınav 2</td>
</tr>

<tr>
<td class="org-center">14</td>
<td class="org-left">Çıkışlı ve Çıkışsız Sonlu Durum Makineleri</td>
</tr>

<tr>
<td class="org-center">15</td>
<td class="org-left">Final</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-org3810ff4" class="outline-2">
<h2 id="org3810ff4">Lojik Devreler</h2>
<div class="outline-text-2" id="text-org3810ff4">
</div>
<div id="outline-container-orge67fa93" class="outline-3">
<h3 id="orge67fa93">Ders Bilgisi</h3>
<div class="outline-text-3" id="text-orge67fa93">
</div>
<div id="outline-container-org1a00af1" class="outline-4">
<h4 id="org1a00af1">Dersin İçeriği</h4>
<div class="outline-text-4" id="text-org1a00af1">
<p>
Sayı Sistemleri; Boole Cebri; Lojik Fonksiyonların İndirgenmesi; Karnaugh Haritaları;<br />
Quine-McClusky Yöntemi; Kombinezonal Devre Analizi; Kombinezonal Devre Tasarımı;<br />
Senkron ve Asenkron Devre Yapıları; Ardışıl Devre Analizi; Ardışıl Devre Tasarımı;<br />
Saklayıcılar, Sayıcılar, Bellekler.<br />
</p>
</div>
</div>

<div id="outline-container-orga68df5f" class="outline-4">
<h4 id="orga68df5f">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</h4>
<div class="outline-text-4" id="text-orga68df5f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Hafta</th>
<th scope="col" class="org-left">Konular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-left">Sayısal sistemlerin genel özellikleri</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-left">Boole cebrinin temelleri</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-left">Lojik fonksiyonlar, kanonik ve standart biçimler</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-left">Lojik kapılar, lojik fonksiyonlarin sadeleştirilmesi</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-left">Karnaugh haritaları/diyagramları, Quine –McCluskey yöntemi</td>
</tr>

<tr>
<td class="org-center">6</td>
<td class="org-left">Kombinezonsal devreler, aritmetik toplama çıkarma devreleri, seçiciler, dağıtıcılar</td>
</tr>

<tr>
<td class="org-center">7</td>
<td class="org-left">Kod çözücüler, kodlayıcılar, ALU tasarımı, 7–parçalı gösterge</td>
</tr>

<tr>
<td class="org-center">8</td>
<td class="org-left">Ardışıl devre temelleri</td>
</tr>

<tr>
<td class="org-center">9</td>
<td class="org-left">Ara Sınav 1</td>
</tr>

<tr>
<td class="org-center">10</td>
<td class="org-left">Ardışıl devrelerin durum tablosu, durum diyagramı ve sonlu durum makineleri</td>
</tr>

<tr>
<td class="org-center">11</td>
<td class="org-left">Flip-Flop’lar: D, T, SR, JK,flip-flopları, tutucular</td>
</tr>

<tr>
<td class="org-center">12</td>
<td class="org-left">Ardışıl devrelerin çözümlenmesi</td>
</tr>

<tr>
<td class="org-center">13</td>
<td class="org-left">Ardışıl devrelerin tasarımı</td>
</tr>

<tr>
<td class="org-center">14</td>
<td class="org-left">Saklayıcılar, sayıcılar, bellekler, programlanabilir ardışıl devreler</td>
</tr>

<tr>
<td class="org-center">15</td>
<td class="org-left">Final</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-org5adb345" class="outline-2">
<h2 id="org5adb345">Sinyaller ve Sistemler</h2>
<div class="outline-text-2" id="text-org5adb345">
</div>
<div id="outline-container-org152001b" class="outline-3">
<h3 id="org152001b">Ders Bilgisi</h3>
<div class="outline-text-3" id="text-org152001b">
</div>
<div id="outline-container-org9ff5de1" class="outline-4">
<h4 id="org9ff5de1">Dersin İçeriği</h4>
<div class="outline-text-4" id="text-org9ff5de1">
<p>
Temel konseptlere giriş; Sinyaller ve Sistemler; Doğrusal ve Zamanla Değişmeyen Sistemler;<br />
Sürekli Zamanlı Sistemlerin Zaman Bölgesi Analizleri; Ayrık Zamanlı Sistemlerin Zaman Bölgesi Analizleri;<br />
Sürekli Zamanlı Fourier Serisi; Ayrık Fourier Dönüşümü; Sürekli Zamanlı Fourier Dönüşümü;<br />
Bazı Fonksiyonların Fourier Dönüşümleri; Örnekleme ve Yeniden-kurma; Laplace Dönüşümü; z-Dönüşümü.<br />
</p>
</div>
</div>
