README.html

<div id="outline-container-orgbcaaf35" class="outline-4">
<h4 id="orgbcaaf35">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</h4>
<div class="outline-text-4" id="text-orgbcaaf35">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Hafta</th>
<th scope="col" class="org-left">Konular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-left">Sinyaller ve Sistemlere genel bakış / Sürekli zamanlı sinyaller / Ayrık zamanlı sinyaller / Sistemler / Sistem örnekleri / Temel sistem özellikleri / Sinüzoidler ve karmaşık sinüzoidler</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-left">Spektrum gösterimi / Fourier Serisi analizi ve sentezi / Fourier Serisi’nin üç gösterimi / Zaman-Frekans spektrumu</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-left">Sürekli Fourier Dönüşümü / Fourier Dönüşümünün özellikleri / Belirli sinyallerin spektral içeriği</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-left">Sürekli zaman sistemlerinin Fourier Analizi / Periyodik ve periyodik olmayan girişlere yanıt / Sürekli zaman filtreleri / Frekans cevabı / Fourier Dönüşümü özelliklerini kullanmaya yönelik örnekler</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-left">Sürekli zamanlı sinyallerin örneklenmesi / Örnekleme ve örtüşme kavramları / Örnekleme ve geri çatma kavramlarının spektrum yaklaşımı / Ayrıktan sürekliye dönüşüm / Örnekleme Teoremi</td>
</tr>

<tr>
<td class="org-center">6</td>
<td class="org-left">Sürekli Zaman Sistem Analizi / Sürekli zamanlı evrişim / Sürekli Zaman transfer fonksiyonu ve frekans cevabı / Frekans cevabını görselleştirmek için sürekli zaman Bode diyagramları.</td>
</tr>

<tr>
<td class="org-center">7</td>
<td class="org-left">Evrişim ve frekans cevabı ile ilgili örnekler</td>
</tr>

<tr>
<td class="org-center">8</td>
<td class="org-left">Sürekli zaman Laplace Dönüşümü / Laplace Dönüşümü özellikleri ve tablosu / Ters Laplace Dönüşümünün hesaplanması</td>
</tr>

<tr>
<td class="org-center">9</td>
<td class="org-left">Ara Sınav 1</td>
</tr>

<tr>
<td class="org-center">10</td>
<td class="org-left">Ayrık-Zamanlı Sistemler / Genel FIR Filtresi / FIR Filtrelerinin Uygulanması / Lineer Zamanla Değişmez (LZD) Sistemler / Evrişim ve LZD sistemler / Kademeli LZD sistemler</td>
</tr>

<tr>
<td class="org-center">11</td>
<td class="org-left">FIR sistemlerinin sinüzoidal yanıtları / Kararlı durum ve geçici yanıt / Frekans cevabının özellikleri / Frekans cevabının grafik temsili</td>
</tr>

<tr>
<td class="org-center">12</td>
<td class="org-left">z-Dönüşümü / z-Dönüşümü ve doğrusal sistemlerin tanımı / z-Dönüşümün özellikleri / z-uzayı ile frekans uzayı arasındaki ilişki</td>
</tr>

<tr>
<td class="org-center">13</td>
<td class="org-left">Ara Sınav 2</td>
</tr>

<tr>
<td class="org-center">14</td>
<td class="org-left">Genel IIR Fark Denklemi / Zaman-uzayı cevabı / IIR Filtrenin sistem fonksiyonu / Kutuplar ve sıfırlar /IIR Filtresinin Frekans Tepkisi / Ters z-Dönüşümü ve bazı uygulamalar / Kararlı durum tepkisi ve kararlılık / İkinci dereceden filtreler / İkinci dereceden IIR filtrelerinin frekans cevabı</td>
</tr>

<tr>
<td class="org-center">15</td>
<td class="org-left">Final</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfbd7a98" class="outline-2">
<h2 id="orgfbd7a98">İstatistiksel Veri Analizi</h2>
<div class="outline-text-2" id="text-orgfbd7a98">
</div>
<div id="outline-container-orgc040855" class="outline-3">
<h3 id="orgc040855">Ders Bilgisi</h3>
<div class="outline-text-3" id="text-orgc040855">
</div>
<div id="outline-container-orga875892" class="outline-4">
<h4 id="orga875892">Dersin İçeriği</h4>
<div class="outline-text-4" id="text-orga875892">
<p>
Temel istatistiksel kavramlar, tanımlayıcı istatistik, şartlı olasılık, rasgele değişkenler,<br />
tahmin-ayrık-sürekli olasılık modeller, birleşik ve örnek dağılımlar, hipotez testi, güven aralıkları,<br />
karmaşıklık matrisi, mantıksal regresyon, doğrusal ve çoklu regresyon ve test teknikleri.<br />
</p>
</div>
</div>
