README.html

<div id="outline-container-org5cb323a" class="outline-4">
<h4 id="org5cb323a">Haftalık Konular ve İlgili Ön Hazırlık Çalışmaları</h4>
<div class="outline-text-4" id="text-org5cb323a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Hafta</th>
<th scope="col" class="org-left">Konular</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-left">Giriş - Bilimsel Araştırmalar Bağlamında İstatistiksel Yöntemler. Örnekleme. Gözlemsel Çalışmalar ve Deneyler. Veri Keşfi ve Analiz. İstatiksel Çıkarım. R kullanarak hesaplama.</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-left">Veri Keşfi - Veri Görselleştirme ve Özet İstatistik. Değişken Türleri. Kategorik Değişkenleri Keşfetmek. Nümerik Değişkenleri Keşfetmek. Veri Önişleme.</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-left">İlişkileri Keşfetmek - Değişkenler Arasındaki İlişkileri Görselleştirme ve Özetleme. İki Sayısal Rastgele Değişken Arasındaki İlişkiler. Kategorik Değişkenler Arasındaki İlişkiler. Sayısal ve Kategorik Değişkenler Arasındaki İlişkiler.</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-left">Olasılık - Belirsizlik Ölçütü Olarak Olasılık. Tümleyen, Birleşim ve Kesişim. Ayrık Etkinlikler. Şartlı Olasılıklar. Bağımsız Etkinlikler. Bayes Teoremi.</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-left">Rastgele Değişkenler ve Olasılık Dağılımları - Rassal Değişkenler. Olasılık Dağılımları. Kümülatif Dağılım İşlevi ve quantile.</td>
</tr>

<tr>
<td class="org-center">6</td>
<td class="org-left">Tahmin - Parametre Tahmini. Nokta Tahmini. Örnekleme dağılımı. Güvenilirlik Aralığı. Hata Marjı.</td>
</tr>

<tr>
<td class="org-center">7</td>
<td class="org-left">Hipotez Testi - Popülasyon Ortalamasına İlişkin Hipotez Testleri. İstatistiksel Anlamlılık. t-testlerini kullanarak hipotez testi. Popülasyon Oranı için Hipotez Testi.</td>
</tr>

<tr>
<td class="org-center">8</td>
<td class="org-left">İki Değişken Arasındaki İlişkinin İstatistiksel Çıkarımı - Bir Sayısal Değişken ile İkili Değişken Arasındaki İlişki. İki ikili Değişken Arasındaki İlişki Üzerinde Çıkarım. İki Nümerik Değişken Arasındaki Doğrusal İlişki ile İlgili Çıkarım.</td>
</tr>

<tr>
<td class="org-center">9</td>
<td class="org-left">Ara Sınav 1</td>
</tr>

<tr>
<td class="org-center">10</td>
<td class="org-left">Varyans Analizi (ANOVA) - Giriş. ANOVA Varsayımları.</td>
</tr>

<tr>
<td class="org-center">11</td>
<td class="org-left">Kategorik Değişkenlerin Analizi - Bir Kategorik Değişken İçin Pearson'un χ2 Testi. Pearson'un χ2 Bağımsızlık Testi. Durum Tabloları.</td>
</tr>

<tr>
<td class="org-center">12</td>
<td class="org-left">Regresyon Analizi - Tek İkili Açıklayıcı Değişkenli Doğrusal Regresyon Modelleri. Basit Doğrusal Regresyon Modellerini Kullanan İstatistiksel Çıkarım. Tek Sayısal Açıklayıcı Değişkenli Doğrusal Regresyon Modelleri. Model Varsayımları ve Teşhisi. Çoklu Doğrusal Regresyon.</td>
</tr>

<tr>
<td class="org-center">13</td>
<td class="org-left">Kümeleme - K-means Kümeleme. Hiyerarşik Kümeleme. Kümelemeden Önce Değişkenleri Standartlaştırma.</td>
</tr>

<tr>
<td class="org-center">14</td>
<td class="org-left">Bayes Analizi - Giriş. Önceki ve Sonraki Olasılıklar. Bayes çıkarımı. Tahmin. Hipotez testi.</td>
</tr>

<tr>
<td class="org-center">15</td>
<td class="org-left">Final</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Furkan Karataş</p>
<p class="date">Created: 2019-02-26 Sal 23:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
